{"id":1065,"date":"2021-11-20T03:33:28","date_gmt":"2021-11-19T22:03:28","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1065"},"modified":"2023-02-13T23:53:00","modified_gmt":"2023-02-13T18:23:00","slug":"are-periods-disgusting","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/periods\/are-periods-disgusting\/","title":{"rendered":"Are periods disgusting?"},"content":{"rendered":"\n<p>First periods come with a lot of questions. One of the most common of these questions is &#8211; are periods disgusting or gross? The answer is NO! Neither periods are disgusting, nor are they gross. Periods are, in fact, totally normal and a natural part of a woman’s life. There is nothing to be ashamed of, and there is no need to feel gross about having them.<\/p>\n\n\n\n<p>The idea that periods are disgusting or dirty is prevalent in many cultures across the world. However, the good news is that there is not much truth to that claim. Thanks to modern science, there is a good understanding and consensus around exactly how and why people get their periods. But in older times, due to a lack of technology and knowledge, societies had to come up with explanations for this phenomenon. As a result, there are beliefs that periods are a curse, impure, polluting, dirty and so on. Lots of traditions have evolved around these beliefs, which would prevent women from going into certain spaces or undertaking certain activities during their periods.<\/p>\n\n\n\n<p>Now, however, we need to recognise that periods are beautiful and menstrual cycles are the basis for the creation of new life.&nbsp;<\/p>\n\n\n\n<p>We will first try to understand what periods are, and then we will go into answering whether they are disgusting or not!<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Why do we get periods?<\/strong><\/p>\n\n\n\n<p>A period (menstruation) is regular vaginal bleeding that is a typical part of a healthy monthly cycle for a person with a uterus and ovaries. Your body prepares to become pregnant every month. To properly care for the implanted embryo, the lining of your uterus thickens with increased blood vessels and improved blood supply. Once the egg is fertilised, it becomes a growing embryo. This embryo will stick to the lining of your uterus, and the blood layer will provide it with the nourishment it needs as it slowly develops into a fully formed human baby. But if the egg is not fertilised, this thick lining of the uterus will begin to degrade itself because your body no longer requires it. As a result, the lining with all its blood supply, eventually passes out through your vagina as a bloody discharge. This process takes place every month, and this is what we call periods or menstruation.<sup>1<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Let us understand this process in detail:<\/strong><\/p>\n\n\n\n<p>On average, the menstrual cycle lasts four weeks, beginning on the first day of bleeding and terminating when the subsequent period starts. Blood, endometrial tissue from the uterus, and the unfertilized egg all make up the menstrual fluid. Usually, one mature egg is released from one of the ovaries and travels to the fallopian tube. This developed egg then passes into the fallopian tube where it may or may not be fertilized. If the mature egg is not fertilized in the fallopian tube, it passes into the uterus and is discarded out of the vagina with the endometrial lining and other menstrual secretions.&nbsp;<\/p>\n\n\n\n<p>If the egg meets the sperm in the fallopian tube, it will be fertilized and referred to as an embryo. When this fertilized egg (embryo) attaches itself to the wall of the uterus (a process known as implantation), you become pregnant.<sup>2<\/sup> Periods usually consist of 2-3 days of relatively intense bleeding followed by 2-4 days of lighter flow. It is normal to bleed for 2 to 7 days. Despite what could appear to be a large amount of blood, most women only lose 1-6 teaspoons of blood and tissue every period. There may be red, brown, or pink bleeding during each period. It is normal for it to be clumpy at times.<sup>3<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How do periods work?<\/strong><\/p>\n\n\n\n<p>Your body has two ovaries. Each of these ovaries contains several tiny eggs. Every month, the ovary releases an egg into the fallopian tube when the egg matures, indicating that it is ready to be fertilised by a sperm. If the egg is fertilised by the sperm, it will result in pregnancy. The hormones create a thick uterine lining to preserve your fertilised egg. Similar to the other organs in your body, the uterus lining is formed of blood and tissues, and it is nutrient-rich to support the development of your baby. But there will not be any pregnancy if the egg is not fertilised. As a result, the uterine lining will shed and flow out of the body through the vaginal opening along with the blood. This primarily describes how your period works.<\/p>\n\n\n\n<p>The average cycle lasts about 28 days, although it can be shorter or longer, ranging from 21 to 40 days. However, if the length of your cycles varies (the gap between the start of one period and the next), you may experience irregular periods. Puberty, significant weight loss or gain, changes in hormone levels, menopause, and medical problems like PCOS, hypothyroidism are a few of the factors that might cause irregular periods.<\/p>\n\n\n\n<p>Your periods typically last 2-7 days. The first few days usually experience the most intense bleeding. During your periods, you will typically lose between 30 to 72 ml of blood.<sup>4 5&nbsp;<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Are periods disgusting? Superstitions about periods in India:<\/strong><\/p>\n\n\n\n<p>There are a lot of superstitious beliefs that society has created over the years about periods. A lot of these superstitions are behavioural prohibitions that, in addition to being incorrect, support discrimination and taboos based on gender. These misconceptions make it more difficult for women to discuss their periods, which promotes silence, shame, and misunderstandings.<\/p>\n\n\n\n<p>Here are just a few of the many beliefs about periods which are NOT true:<\/p>\n\n\n\n<ul>\n<li>You should not touch anything or anybody at home.<\/li>\n\n\n\n<li>You should not exercise during your periods.<\/li>\n\n\n\n<li>You should not wash your hair during your periods until the third or fourth day.<\/li>\n\n\n\n<li>You should wash your pads before disposing them.<\/li>\n\n\n\n<li>You should not have sex on your periods.<\/li>\n\n\n\n<li>You are not permitted to enter a kitchen or prepare food for others.<\/li>\n\n\n\n<li>You are not allowed into a place of worship.<\/li>\n\n\n\n<li>Only after washing your hair on or after the fourth day, you may enter the kitchen or, the place of worship.<\/li>\n\n\n\n<li>You should not apply henna (mehndi) on your periods.<\/li>\n\n\n\n<li>You cannot touch plants when you are menstruating.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>None of the above-stated superstitions have any scientific evidence as to why they should be followed. These have been created by society and have no bearing on periods being impure or something out of the world.&nbsp;<\/p>\n\n\n\n<p>Periods are not disgusting and should not have any superstitions and restrictions on someone’s life. Periods are a normal part of a woman’s life. In fact, a beautiful one as it is the very foundation of birth. So stop believing in these myths and superstitions with no head and tail. And celebrate and pamper yourself!<sup> 6<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Is having a period gross?<\/strong><\/p>\n\n\n\n<p>No, having periods is not gross at all! The way people have defined it makes it feel gross. In fact, periods should be celebrated and not spoken about in hushed tones since periods cause life to continue. The menstrual cycle consists of a delicate balance between multiple hormones, glands, and organs. The hypothalamus and pituitary glands control hormones which in turn control estrogen and progesterone levels. Estrogens and progesterone levels also vary along your menstrual cycle, reaching a high when ovulation occurs with progesterone levels then taking over and gradually ebbing with the onset of bleeding. If bleeding doesn’t occur and the egg released by the ovary is fertilised by meeting a sperm, it will result in pregnancy and, thus, life will continue.<\/p>\n\n\n\n<p>There is no need for us to hide a tampon up our sleeve or have to whisper about needing a tampon. Talking about periods isn&#8217;t something out of the norm. The more we can talk about our periods, the fewer people will think periods are gross.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Is period blood clean or dirty? Why is period considered dirty?<\/strong><\/p>\n\n\n\n<p>Due to the patriarchal nature of society and lack of scientific advancement, period blood was termed impure historically. No one understood why women would bleed every month, so different cultures came up with their own explanations. However, thanks to scientific advancement, we now know exactly why we get periods, and there is no need anymore to refer to these old beliefs. In many societies, women were socially distanced and made to isolate themselves from their families, often in highly unhygienic conditions because those cultures believed that period blood was polluting or dirty. However, none of those practices are grounded in any scientific facts.&nbsp;Period blood is not dirty or an infectious agent and does not cause infections. What can cause infections is letting menstrual products like pads or tampons stay in for so long that the blood starts attracting infections. As long as one maintains proper hygiene, there is no reason to think of period blood as dirty!<sup> 7<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>Still feel periods are disgusting? Come to the Pinky Promise App and chat with thousands of women to get instant answers to your questions!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"715\" class=\"wp-image-1483\" style=\"width: 500px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Are-periods-disguidsting_.png\" alt=\"Are periods disgusting\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Are-periods-disguidsting_.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Are-periods-disguidsting_-300x199.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Are-periods-disguidsting_-1024x679.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Are-periods-disguidsting_-768x509.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[15],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1065"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1065"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1065"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}