{"id":1098,"date":"2021-11-20T04:16:43","date_gmt":"2021-11-19T22:46:43","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1098"},"modified":"2022-09-19T17:23:50","modified_gmt":"2022-09-19T11:53:50","slug":"what-is-it-like-to-have-periods","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/periods\/what-is-it-like-to-have-periods\/","title":{"rendered":"What is it like to have periods?"},"content":{"rendered":"\n<p>Every menstruator and her experience regarding periods are different from others! It is common for some to experience bloating, pimples, sore breasts, and emotional upheaval during their cycle. A lot of people experience menstrual cramps in their lower back, belly, or legs before their period. These are called Premenstrual Syndrome (PMS). Some people, however, do not experience these symptoms. Sometimes these symptoms change from one month to the next. Your period usually becomes easier to predict when you are getting older.<\/p>\n\n\n\n<p>People often mark their calendar or use some app to mark the day on which their period starts in order to keep a track of their periods (you can use ours too!). Your next period will be easier to predict if you keep track of your periods. Keeping track of your periods can also help you know whether your <a href=\"https:\/\/askpinkypromise.com\/faq\/periods\/why-do-periods-come-early\/\" target=\"_blank\" rel=\"noreferrer noopener\">period is coming early<\/a> or late. Particularly as a teenager, it is pretty common to not get your period on the exact same day every month.&nbsp;<\/p>\n\n\n\n<p>The menstrual cycle is about four weeks long on average, starting on the first day of bleeding and ending when the next period begins. However, it can vary greatly when girls first start their periods. It may skip months or come several times per month in the beginning. The first 2 years are usually cramp-free. The fluid of menstrual discharge is made up of blood, uterus lining (endometrial tissue) and unfertilised egg. Periods happen when one of the ovaries releases a mature egg which further enters the fallopian tube. This mature egg then travels through the fallopian tube and enters the uterus. While travelling if the matured egg doesn’t get fertilised, it flows out of the vagina along with other menstrual fluids. The same egg may meet the sperm in the fallopian tube. That’s when this matured egg will be known as a fertilised egg. When this fertilised egg sticks itself to the uterus (a process called implantation), you are said to be pregnant.<sup>1<\/sup><\/p>\n\n\n\n<p>During periods, there are usually 2-3 days of relatively heavy bleeding followed by 2-4 days of lighter flow. Anywhere between 2 to 7 days is normal to bleed during your periods. The amount of blood that comes out may seem a lot, but most women only lose 2-3 tablespoons of blood and tissue each period. During each cycle, people may experience bleeding that is red, brown, or pink in colour. Sometimes, it is natural for it to be a little clumpy.<\/p>\n\n\n\n<p>It’s normal for women to have periods that may not always be regular. But please note that missed periods can also be a&nbsp;sign of pregnancy or other underlying issues. If you’ve had unprotected sex and skipped your period, it is advised to take a pregnancy test in order to be sure whether you are pregnant or not.<sup>2<\/sup>          <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"719\" class=\"wp-image-1481\" style=\"width: 500px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-it-like-to-have-periods_.png\" alt=\"What is it like to have periods\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-it-like-to-have-periods_.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-it-like-to-have-periods_-300x200.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-it-like-to-have-periods_-1024x682.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-it-like-to-have-periods_-768x512.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[15],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1098"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1098"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1098"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}