{"id":1102,"date":"2021-11-20T04:37:26","date_gmt":"2021-11-19T23:07:26","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1102"},"modified":"2023-02-13T23:55:05","modified_gmt":"2023-02-13T18:25:05","slug":"can-green-discharge-indicate-a-sexually-transmitted-disease","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/sexually-transmitted-infections\/can-green-discharge-indicate-a-sexually-transmitted-disease\/","title":{"rendered":"Can green discharge indicate a sexually transmitted infection?"},"content":{"rendered":"\n<p>Yes! Green vaginal discharge can often be a sign that indicates a sexually transmitted disease (STD) or a sexually transmitted infection (STI). In fact, the most common cause of the green or yellowish-green discharge is a sexually transmitted infection (STI). The sexually transmitted infections linked to greenish vaginal discharge or yellowish-green discharge are Trichomoniasis, Gonorrhea and Chlamydia.&nbsp;<\/p>\n\n\n\n<p>There are different types of vaginal discharge which indicate either the normal functioning of the body or the different types of vaginal infection. For example &#8211; There can be various reasons for white discharge. A milky white discharge can indicate that your body is preparing for ovulation. While if you experience thick white cottage cheese discharge accompanied by itching or burning, it may indicate an yeast infection.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What does green discharge mean?&nbsp;<\/strong><\/p>\n\n\n\n<p>Green discharge means you may have a sexually transmitted infection (STI). It is not considered normal and should be treated as soon as you know about it.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What can cause green discharge?&nbsp;<\/strong><\/p>\n\n\n\n<p>The most frequent reason for green vaginal discharge is a sexually transmitted infection. Many different kinds of infections can affect the vagina and cause unusual discharge. The STD that causes green discharge can be Trichomoniasis, Chlamydia, or Gonorrhea.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What are the symptoms and causes of Gonorrhea?&nbsp;<\/strong><\/p>\n\n\n\n<p>Gonorrhea is caused by a bacteria known as<em> Neisseria gonorrhoeae<\/em>. It is quite common among teenagers and young adults who belong to the age group of 15-24. While the symptoms of Gonorrhea are often unnoticed (asymptomatic), a change in the colour of the vaginal discharge is the key symptom.&nbsp;<\/p>\n\n\n\n<p>Having a creamy or greenish vaginal discharge (even light green vaginal discharge), lower abdominal pain, burning or pain during urination, frequent urination, painful sex, spotting between periods, anal itching, and soreness &#8211; are common symptoms of gonorrhea.<sup>1<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Is Chlamydia discharge green?&nbsp;<\/strong><\/p>\n\n\n\n<p>Yes, the vaginal discharge colour for chlamydia may be green or greenish-yellow or yellowish. Like gonorrhea, chlamydia is also a bacterial infection and often displays no symptoms at all &#8211; staying silently in your system and causing complications in the future. Chlamydia is also the most common STI caused by a bacteria. If you experience symptoms of chlamydia, one of them can be the presence of greenish, whiteish, yellowish, cream or even greyish vaginal discharge that smells bad. Other symptoms of chlamydia are very similar to that of gonorrhea.<sup>2<\/sup>&nbsp;<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Can BV cause green discharge?&nbsp;<\/strong><\/p>\n\n\n\n<p>Bacterial vaginosis (BV) is a type of vaginal inflammation or infection. BV is caused by an overabundance of the normally-occurring bacteria in the vagina. These bacteria are usually kept in check by the “healthy” bacteria in the vagina. An overgrowth of the “bad” bacteria throws off the delicate pH balance of the vagina and causes inflammation down there.&nbsp;<\/p>\n\n\n\n<p>Although BV can impact women of any age, it is more common in women in their reproductive years. Although the exact cause is unknown, certain actions like having unprotected sex or changing a sexual partner or douching or using scented products in or around the vagina raise the risk of BV.<\/p>\n\n\n\n<p>The signs and symptoms of BV include &#8211; grey, white or thin vaginal discharge with a foul-smelling odour, vaginal irritation, usually no itching, a burning sensation while peeing, etc. Most women who have BV do not show any signs or symptoms.<sup>3<\/sup>&nbsp;<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Can you have green discharge without an STD?&nbsp;<\/strong><\/p>\n\n\n\n<p>Yes. Green, greenish-yellow or yellowish vaginal discharge can also result from bacterial vaginosis (BV). Unlike Gonorrhea, Chlamydia and Trichomoniasis, BV is not a sexually transmitted infection. When there is an imbalance between the &#8220;healthy&#8221; and &#8220;bad&#8221; bacteria in the vagina, it leads to BV.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How do you treat green vaginal discharge?&nbsp;<\/strong><\/p>\n\n\n\n<p>If you notice green or yellowish-green discharge, please see a doctor and get tested for sexually transmitted infections. In order to check if you have an STI, your doctor may take a blood sample, a urine sample, and a swab of the affected area. Even if you do not have any visible <a href=\"https:\/\/askpinkypromise.com\/faq\/sexually-transmitted-infections\/when-do-symptoms-of-std-start\/\" target=\"_blank\" rel=\"noreferrer noopener\">symptoms of STI<\/a>, you should still get tested. According to the Centers for Disease Control and Prevention, most of the time, sexually transmitted infections do not show any symptoms at all.&nbsp;<\/p>\n\n\n\n<p>If it turns out that you do have an STI, the treatment is straightforward! Most of the time, your doctor will prescribe you a course of antibiotics that will kill the disease-causing bacteria and probiotics to help the “healthy” bacteria.&nbsp;<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Which STD causes a yellow-green discharge?&nbsp;<\/strong><\/p>\n\n\n\n<p>The presence of a mild yellow colour in the discharge does not necessarily imply a concern. This is particularly true if the colour change only happens after changing your diet or taking supplements.<\/p>\n\n\n\n<p>It&#8217;s abnormal to have a yellow or green discharge, especially if it&#8217;s chunky, thick, or smells bad. This kind of discharge might be a sign of trichomoniasis infection. It typically spreads through sexual intercourse. Consult a doctor if you are experiencing this type of discharge.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Can a UTI cause green discharge?&nbsp;<\/strong><\/p>\n\n\n\n<p>No, a UTI cannot cause a green discharge. In most cases, a sexually transmitted infection (STI) is responsible for the cause of the green discharge.<\/p>\n\n\n\n<p>On the other hand, urinary tract infection (UTI) can be caused by an STI. This is an infection of the lower urinary tract &#8211; the bladder as well as the urethra. They occur more commonly in women, which is why women are at a higher risk than men. UTI occurs when bacteria enter the urinary tract through the urethra and multiply inside the bladder. In spite of the urinary system&#8217;s protective features, these defenses are sometimes inadequate to keep out such minute invaders. When this happens, it is possible for bacteria to take hold and develop into a full-blown infection in the urinary tract.<sup>4<\/sup><\/p>\n\n\n\n<p>Leaving a sexually transmitted infection untreated is never a good idea because it can cause complications in your system, like pelvic inflammatory disease and infertility. It also puts you at a greater risk of contracting HIV\/AIDS and passing on the disease to others. After reading this article, if you feel you are at risk of an STI, it may be a good idea to contact your doctor and get tested for the same!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\">      <img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"710\" class=\"wp-image-1457\" style=\"width: 440px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Can-green-discharge-indicate-a-Sexually-Transmitted-Disease_.png\" alt=\"Green Vaginal Discharge- pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Can-green-discharge-indicate-a-Sexually-Transmitted-Disease_.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Can-green-discharge-indicate-a-Sexually-Transmitted-Disease_-300x197.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Can-green-discharge-indicate-a-Sexually-Transmitted-Disease_-1024x674.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/Can-green-discharge-indicate-a-Sexually-Transmitted-Disease_-768x505.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[14],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1102"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1102"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1102"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}