{"id":1104,"date":"2021-11-20T04:38:31","date_gmt":"2021-11-19T23:08:31","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1104"},"modified":"2023-03-08T08:35:44","modified_gmt":"2023-03-08T03:05:44","slug":"what-is-the-main-cause-of-std","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/sexually-transmitted-infections\/what-is-the-main-cause-of-std\/","title":{"rendered":"What is the main cause of STI?"},"content":{"rendered":"\n<p>The causes of STDs\/STIs are largely vaginal, anal and oral sex. Very rarely, kissing and skin-to-skin contact can also transmit STIs. Not all sexually transmitted infections need to turn into a ‘disease’. When the infections are treated with the right care and treatment, the chances of it developing into a legit serious disease usually gets nullified. Sexually transmitted infections (STIs) are a very broad category of bacterial, viral and parasitic infections which are transmitted by sexual contact. There are several types of STIs, within this broad category, and they all work slightly differently in how they cause an infection within your body. HIV, for example, is a viral infection that works to affect the functioning of your immune system, making you more susceptible to other diseases. HPV (Human Papillomavirus) is also a virus family, but it causes warts in your genital region and in some cases, cervical cancer. Gonorrhea and Chlamydia, on the other hand, are bacterial infections which cause a whole variety of symptoms including strange coloured and foul smelling discharge, painful sex, spotting in the middle of the cycle, and abdominal pain. Finally, Trichomoniasis is caused by a parasite!<\/p>\n\n\n\n<p>Even among sexual activities, some are more riskier than others. Vaginal and anal sex lead to more risk of transmission than oral sex, followed by activities like making-out, kissing and so on. However, since its never a good idea to play a chance game, its important to protect oneself against STIs no matter the nature of sexual activity &#8211; be it making-out or fondling or sexual intercourse. HPV and Genital Herpes are two sexually transmitted infections which can spread through contact. In the case of Genital Herpes, one can get it by coming into contact with a sore of an infected person, usually found in the genital area. HIV and Hepatitis-B are sexually transmitted infections which also spread easily if you inject drugs using contaminated syringes.&nbsp;<\/p>\n\n\n\n<p>There are several strategies to <a href=\"https:\/\/askpinkypromise.com\/faq\/sexually-transmitted-infections\/how-to-prevent-std\/\" target=\"_blank\" rel=\"noreferrer noopener\">prevent STDs<\/a>\/STIs. The first and most important practice is to use latex based condoms during vaginal and anal intercourse, and dental dams for oral sex. Most condoms available in pharmacies are latex based. They work as a physical barrier between an infected person&#8217;s fluids and your own body. Secondly, it is important to keep testing for STIs and to always ask your partner about their STI history and recent reports before getting into a physical relationship. This may feel like an awkward conversation but in fact, it will help you build a bridge of trust early on in the relationship. Regular testing is important because most sexually transmitted infections tend to stay silent in your system and show no symptoms (According to the Centres for Disease Control and Prevention). Finally, for prevention and early detection of HPV, it’s a great idea to get vaccinated against HPV and to also go in for regular pap smears after the age of 21! <sup>1 2<\/sup><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"645\" class=\"wp-image-1456\" style=\"width: 560px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-the-main-cause-of-STD_.png\" alt=\"causes of std-pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-the-main-cause-of-STD_.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-the-main-cause-of-STD_-300x179.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-the-main-cause-of-STD_-1024x612.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/What-is-the-main-cause-of-STD_-768x459.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/>  <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[14],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1104"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1104"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1104"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}