{"id":1106,"date":"2021-11-20T04:39:48","date_gmt":"2021-11-19T23:09:48","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1106"},"modified":"2023-03-04T09:09:48","modified_gmt":"2023-03-04T03:39:48","slug":"how-to-prevent-std","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/sexually-transmitted-infections\/how-to-prevent-std\/","title":{"rendered":"How to prevent STD?"},"content":{"rendered":"\n<p>Sexually Transmitted Infections (STIs), aka Sexually Transmitted Diseases (STDs), are spread through sexual contact. This includes oral, vaginal and anal sex and some (rare) times, through kissing and skin-to-skin contact.&nbsp;<\/p>\n\n\n\n<p>Sexually transmitted infections are extremely common. However, you can easily prevent STD\/STI simply by following certain guidelines. Amongst the wide variety of STDs\/STIs, few are classified as curable STDs\/STIs and few are classified as <a href=\"https:\/\/askpinkypromise.com\/faq\/sexually-transmitted-infections\/what-stds-have-no-cure\/\" target=\"_blank\" rel=\"noreferrer noopener\">incurable STDs<\/a>\/STIs. STIs when not treated well on time may lead to life threatening issues. Hence, it is always advised to get yourself tested at least once a year for STIs if you are sexually active.<\/p>\n\n\n\n<p>There are a lot of things you can do for Prevention of Sexually Transmitted Infections (STIs):<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>1. Use a condom:<\/strong><\/h2>\n\n\n\n<p>While having vaginal and\/or anal sex, try to use a latex condom. Using latex condoms every time while having sex is considered to be the safest way to prevent yourself from contracting an STI. It’s important to make sure you know how to put on a condom properly to avoid any slipping or damage, and also do not carry a condom in a place that is exposed to high friction like a wallet or the inside pocket of your jeans! Remember to also change your condom when switching between vaginal to anal or oral to vaginal and so on.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>2. Ask for results:<\/strong><\/h2>\n\n\n\n<p>Before getting into an intimate relationship, try asking your partner about their recent STI test results! Doing so will help initiate an enabling conversation and will also help you ensure you are not at risk of contracting an STI.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>3. Avoid condom-less sex with multiple partners:<\/strong><\/h2>\n\n\n\n<p>Although it is often said that having sex with multiple partners can increase the chances of catching STI, this is often because you now need to consider the status of multiple people! Therefore, it is beneficial to stick to mutual monogamy (having sex with only one partner) or using a condom at all times.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>4. Use dental dams for oral sex:<\/strong><\/h3>\n\n\n\n<p>Dental dams prevent the transmission of STD from a vagina or from one’s mouth to a vagina owner, during oral sex. You can place the dental dam as a barrier over the genital area and perform oral sex over it. Dental dams are advised especially if one has multiple sexual partners.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>5. Get the HPV vaccine and have routine pap smears:<\/strong><\/h3>\n\n\n\n<p>According to the Centre for Disease Control and Prevention (CDC), HPV is one of the common STI among women. HPV is the predominant cause of cervical cancer and cervical cancer is the leading cause of cancer related deaths among women. Despite that, almost every person who is sexually active is at a risk of getting HPV once in their lifetime. Therefore, it important to get yourself vaccinated against HPV before you get sexually active. The HPV vaccine should be taken as early as ages 11 for boys and 12 for girls. Also, routine pap smears after the age of 21 is always a good idea! <sup>1<\/sup><\/p>\n\n\n\n<p class=\"has-text-align-center\">   <img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"716\" class=\"wp-image-1454\" style=\"width: 480px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/How-to-prevent-STD_.png\" alt=\"prevent stds- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/How-to-prevent-STD_.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/How-to-prevent-STD_-300x199.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/How-to-prevent-STD_-1024x680.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/11\/How-to-prevent-STD_-768x510.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[14],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1106"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1106"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1106"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}