{"id":1299,"date":"2021-12-01T13:52:52","date_gmt":"2021-12-01T08:22:52","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1299"},"modified":"2022-09-19T17:05:26","modified_gmt":"2022-09-19T11:35:26","slug":"how-can-i-test-for-a-urinary-tract-infection","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/uti\/how-can-i-test-for-a-urinary-tract-infection\/","title":{"rendered":"How can I test for a urinary tract infection?"},"content":{"rendered":"\n<p>Urinary Tract Infections (UTI) are bacterial infections that affect the urinary tract (urethra, ureters, bladder and kidneys). Typical symptoms of a UTI include painful urination, burning sensation while peeing, frequent urge to urinate, a feeling as if the bladder hasn’t been emptied despite urinating, abdominal pain, cloudy urine and blood in the urine. Sometimes, these symptoms on their own are enough for a doctor to confidently diagnose you as having a UTI. However, often, doctors will also prescribe a urinary tract infection test so they can confirm the presence of an infection and also identify how to treat it! <sup>1<\/sup><\/p>\n\n\n\n<p>The two most common tests are a urine routine test and a urine culture test. The urine routine test confirms if you have an infection by checking for white blood cells, blood, pus, the acidity of urine and so on. Without an infection, you typically won’t find these in your urine in high quantities. The urine culture test works to test if the infection is resistant to any antibiotics. Should the urine routine test turn out to confirm the presence of an infection, the results of the urine culture test will help the doctor to prescribe an antibiotic which will actually respond to the bacteria causing the infection. One should not start consuming antibiotics before giving a urine sample for these two tests as doing so would make the tests ineffective.<sup>2<\/sup><\/p>\n\n\n\n<p>Women are more prone to UTIs because of the smaller size of their urinary opening as compared to men. Also, the female body is designed in a way that their urethra and anus are situated closely. Because of this reason, a woman’s bladder and urethra are mainly the common parts to catch an infection more easily. Escherichia coli commonly known as <strong><em>E coli<\/em> <\/strong>is a type of bacteria that is mostly responsible for UTIs. It is most commonly found in faeces and organic content. This bacteria lives forever inside our intestine but that’s not a problem. It&#8217;s worrisome when it finds its way to move out of the intestine and lands up in the urinary tract. This in turn leads the bacteria to develop into a proper full-blown infection. Bladder infection called Cystitis is usually caused by <strong><em><strong><em>E coli <\/em><\/strong>bacteria.<\/em><\/strong><sup>3<\/sup><\/p>\n\n\n\n<p>Sometimes, UTIs may not entirely go away or they may come back to infect you. You may have a recurrent UTI if you catch three or more UTIs in a span of 12 months. Recurrent UTI have to be dealt with in a slightly different manner based on what your doctor thinks. They may recommend a continuous course of antibiotics or choose to treat you as and when you relapse, with some behavioural modifications.<sup>4<\/sup><\/p>\n\n\n\n<p>Technically it takes 24-48 hours for UTI antibiotics to show results. However, there is a chance that sometimes, the bacteria responsible for the UTI may not respond to the antibiotics or treatments that may be prescribed to you. This could be a sign of a complicated UTI or an underlying disease. Some risk factors for complicated UTIs include &#8211; your age, anatomy, having a weak immune system or being pregnant. Disease like cancer, diabetes, a history of infections such as kidney infection or any other infections, urologic issues, etc could also be one of the reasons. Your doctor may take a CT scan to see if there are any obstructions in the urinary tract. Cases of complicated UTI may require treatment with broad spectrum antibiotics, a longer course of treatment, and sometimes hospitalisation and intravenous administration of antibiotics.<sup>5&nbsp;<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"> <img decoding=\"async\" loading=\"lazy\" width=\"1075\" height=\"636\" class=\"wp-image-1423\" style=\"width: 420px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-test-for-a-Urinary-Tract-Infection_-1-1.png\" alt=\"\nurinary tract infection test- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-test-for-a-Urinary-Tract-Infection_-1-1.png 1075w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-test-for-a-Urinary-Tract-Infection_-1-1-300x177.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-test-for-a-Urinary-Tract-Infection_-1-1-1024x606.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-test-for-a-Urinary-Tract-Infection_-1-1-768x454.png 768w\" sizes=\"(max-width: 1075px) 100vw, 1075px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[12],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1299"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1299"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1299"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}