{"id":1303,"date":"2021-12-01T14:00:39","date_gmt":"2021-12-01T08:30:39","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1303"},"modified":"2022-09-19T17:24:34","modified_gmt":"2022-09-19T11:54:34","slug":"what-is-pcos","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/polycystic-ovaries\/what-is-pcos\/","title":{"rendered":"What is PCOS?"},"content":{"rendered":"\n<p class=\"has-medium-font-size\"><strong>Introduction:&nbsp;<\/strong><\/p>\n\n\n\n<p>Polycystic Ovary Syndrome (PCOS) is a commonly occurring condition among women of reproductive age. PCOS can happen at any time and at any age in women after she hits her puberty. For someone who already has PCOS since puberty, for them the signs and symptoms will show up in their early period cycles only. But that may not be the case for every woman! Other women might get it in their 20s or 30s or even later in their reproductive age.<sup>1<\/sup>According to Cleveland Clinic, PCOS is very common — up to 15% of women of reproductive age have it. It is said to be one of the most common causes of female infertility.<sup>2<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Signs and symptoms:<\/strong><\/p>\n\n\n\n<p>Usually the signs and symptoms of PCOS are prominent enough to tell if you have PCOS or not. Doctors typically use a set of criteria to determine PCOS in women, jointly called the Rotterdam Criteria,<sup>3<\/sup> which states that two of these three conditions should be present:<\/p>\n\n\n\n<p><strong>1. Hyperandrogenism:<\/strong>&nbsp;<\/p>\n\n\n\n<p>Hormone levels play a major role in the functioning of the period cycle. Increased levels of a male hormone known as androgen obstructs the ovaries from performing the function of ovulation (releasing an egg). Failure to release an egg eventually results in irregular and missed periods. Furthermore, excess production of androgen leads to Hirsutism which causes excess hair growth on face, chin, body, acne and male pattern baldness. Your doctor will conduct a physical exam to check the signs of hirsutism by simply checking for excess hair growth in the mentioned places.&nbsp;<\/p>\n\n\n\n<p><strong>2. Infrequent\/irregular periods:&nbsp;<\/strong><\/p>\n\n\n\n<p>Another most common sign to determine if you have PCOS or not is by observing the pattern of your menstrual cycle every month. Usually women with PCOS experience irregularity in their menstrual cycle. The irregularity in menstrual cycles can be observed often in the form of missed\/skipped periods. The possible reason behind your missed\/skipped periods could be the failure of ovaries to release an egg due to multiple cysts.<\/p>\n\n\n\n<p><strong>3. Polycystic ovaries:<\/strong><\/p>\n\n\n\n<p>Every woman is born with two ovaries that produce eggs and hormones throughout her lifetime. Polycystic ovaries are basically ovaries that develop small multiple fluid filled sacs AKA cysts. It is believed that if either one or both ovaries possess cysts, your chances of developing PCOS are potentially high. Though, not everyone with PCOS develops polycystic ovaries. Similarly, not everyone with cysts in their ovaries has PCOS. In order to check for the presence of cysts in&nbsp; the ovaries, your doctor would want to conduct two lab tests. A pelvic ultrasound and a pelvic exam. A pelvic ultrasound will help to find out the presence of cysts plus the thickness of uterus lining. While, a pelvic exam will help to check if your ovaries look swollen or not and whether there is any abnormal growth in\/around your uterus.&nbsp;<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Know more:<\/strong><\/p>\n\n\n\n<p>Apart from the Rotterdam criteria, excess weight gain and hormonal imbalances are other common reasons that can increase the risk of developing PCOS. PCOS is 80% most commonly found in women who are obese or overweight. To inspect the hormone imbalances in women, your doctor would recommend you to take a blood test. It is important to measure the androgen levels, insulin, cholesterol and triglyceride levels while checking for the risk or cause of PCOS.&nbsp;<\/p>\n\n\n\n<p>Some women may not even show any signs and symptoms and yet have PCOS. Some may get it from their family if in case that’s something running in their genetics. Yet there is no cure for PCOS. Losing weight, appropriate diet and adapting certain lifestyle changes can however help to manage PCOS and limit its impact on the future.<sup>4<\/sup>    <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"> <img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"633\" class=\"wp-image-1475\" style=\"width: 530px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-is-PCOS.png\" alt=\"what is pcos-ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-is-PCOS.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-is-PCOS-300x176.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-is-PCOS-1024x600.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-is-PCOS-768x450.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[62],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1303"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1303"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1303"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}