{"id":1304,"date":"2021-12-01T14:06:10","date_gmt":"2021-12-01T08:36:10","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1304"},"modified":"2022-08-10T12:59:33","modified_gmt":"2022-08-10T07:29:33","slug":"how-can-i-check-if-i-have-pcos","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/polycystic-ovaries\/how-can-i-check-if-i-have-pcos\/","title":{"rendered":"How can I check if I have PCOS?"},"content":{"rendered":"\n<p>If you suspect that you may have PCOS, it is important to know that you may have to undergo multiple tests to confirm if indeed you do have it. There is no single test that, by itself, shows if someone has PCOS or not. Doctors typically use the Rotterdam criteria for diagnosis of PCOS. It states that in order to check PCOS, two of these three conditions should be present: <\/p>\n\n\n\n<ul><li>heightened level of male hormones called androgens (hyperandrogenism)<\/li><li>irregular or infrequent or absent periods (ovulatory dysfunction) and&nbsp;<\/li><li>polycystic ovaries (cysts in the ovaries)&nbsp;<\/li><\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>High levels of androgen can be determined through normal physical observation. It is said to be high if you have excess hair growth on face, chin and body (hirsutism), male pattern baldness and acne.&nbsp;<\/p>\n\n\n\n<p>Often, you may start suspecting you have PCOS if you are experiencing irregular or absent periods. Generally the normal menstrual cycle is between 21-35 days, with an average at 28 days. Fluctuations in these cycle lengths by a day or 2 is also completely normal! What is not normal is having a period cycle greater than 35 days, missing your periods for a month or more entirely, or experiencing less than 9 periods in a year. All of these could be a sign of PCOS. Some other times, you may be getting regular periods but they may be long and painful, or you may be suffering from other symptoms like hairfall, acne, facial hair, male pattern balding and so on, which could be signs of higher than average levels of male hormones (called as androgens).<\/p>\n\n\n\n<p>Most doctors rely on their experience as well as a method called the Rotterdam criteria, to provide a confirmation of PCOS. Often, before proceeding for any sort of PCOS blood tests or imaging, your gynaecologist might ask you some basic questions about your medical history, the pattern of your periods, weight fluctuations, etc. They will also understand if you may have symptoms that show a higher than average level of male hormones. Then, they may ask you to undergo a blood test for certain hormone levels like estradiol, FSH, LH and androgens as well as an ultrasound to see what your ovaries look like. Often, in many cases of PCOS, the ovaries contain fluid filled sacs of immature eggs which never matured to be large enough to be released out. This is called polycystic ovaries. As a result of egg cells which never matured, ovulation didn’t occur that month and neither did you bleed! If you are experiencing two of these three things &#8211; elevated male hormones, infrequent\/irregular periods, and polycystic ovaries &#8211; doctors may diagnose you as having PCOS.<\/p>\n\n\n\n<p>Furthermore, your doctor may want to conduct a pelvic examination. This is a physical examination! Through this he\/she will be able to check for the presence of any mass or other abnormality in your reproductive organs. Also, since PCOS has a relationship with insulin resistance and diabetes, your doctor may ask you to take a blood test to measure the androgen, insulin, cholesterol and triglyceride levels. Early detection and management of PCOS can save you from the risk of heart disease and diabetes further.<sup>1<\/sup><\/p>\n\n\n\n<p>There are several PCOS symptom trackers online, including at Pinky Promise, which you can use to get an understanding of PCOS.&nbsp; <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"> <img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"724\" class=\"wp-image-1473\" style=\"width: 450px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-check-if-I-have-PCOS_.png\" alt=\"how to check pcos- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-check-if-I-have-PCOS_.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-check-if-I-have-PCOS_-300x201.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-check-if-I-have-PCOS_-1024x686.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/How-can-I-check-if-I-have-PCOS_-768x515.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[62],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1304"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1304"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1304"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}