{"id":1319,"date":"2021-12-13T20:05:55","date_gmt":"2021-12-13T14:35:55","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1319"},"modified":"2023-05-19T18:12:28","modified_gmt":"2023-05-19T12:42:28","slug":"what-are-the-side-effects-of-emergency-contraceptive-pills","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/emergency-contraception\/what-are-the-side-effects-of-emergency-contraceptive-pills\/","title":{"rendered":"What are the side effects of emergency contraceptive pills?"},"content":{"rendered":"\n<p>An emergency contraceptive pill (ECP) is an <a href=\"https:\/\/askpinkypromise.com\/faq\/emergency-contraception\/what-is-emergency-contraception\/\" target=\"_blank\" rel=\"noreferrer noopener\">emergency contraceptive method<\/a><strong> <\/strong>taken within the first 72 hours or within the first three days of having unprotected sex. It is also popularly known as the Morning-After Pill. These pills help to prevent an unintended pregnancy in case your primary birth control method has failed or contraception wasn’t used. The side effects of emergency contraceptive pills on your health and hormones may be significant and should be kept in mind.<sup>1<\/sup>&nbsp;<\/p>\n\n\n\n<p>The morning-after pill should only be used as a backup method of birth control and not as the primary method of contraception as it is a very high-dose pill meant for rare emergency use only. ECP cannot stop a pregnancy that has already begun! So, if your pregnancy test is positive, your doctor will need to examine you and prescribe an abortion pill. Do not confuse the morning-after pill (the ECP) with Mifepristone (Mifeprex) or RU-486, also referred to as the abortion pill.<\/p>\n\n\n\n<p>Levonorgestrel (the Emergency Contraceptive pill) is an ‘over-the-counter’ pill which means it is available without a prescription in India.<sup>2<\/sup> It helps <a href=\"https:\/\/askpinkypromise.com\/faq\/pregnancy\/how-to-prevent-pregnancy\/\" target=\"_blank\" rel=\"noreferrer noopener\">prevent pregnancy<\/a> by delaying or stopping ovulation. Further, you must remember the emergency contraceptive pill cannot stop a pregnancy that has already happened. <\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>How do emergency contraceptive pills affect your body?<\/strong><\/h2>\n\n\n\n<p>The fact is that the dose of hormones in the ECP is significantly more than something intended for daily use, like the <a href=\"https:\/\/askpinkypromise.com\/faq\/contraception\/what-are-daily-oral-contraceptive-pills\/\" target=\"_blank\" rel=\"noreferrer noopener\">daily oral contraceptive pill<\/a> (birth control pills). As a result, people who overuse ECPs may see their menstrual cycle being affected &#8211; their periods may not resume normally, may be heavy, may have irregular bleeding, etc. They may also observe weight gain and so on. ECPs are not recommended as long-term contraception options or as a replacement for standard birth control. It is never a good idea to rely on emergency contraceptive pills as a substitute for your regular contraceptive method like &#8211; condoms, pills, intrauterine devices (IUDs), and so on.<sup>3<\/sup><\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>When to take the emergency contraceptive pill?<\/strong><\/h2>\n\n\n\n<p>Emergency contraceptive pills are not the same as regular birth control pills or other forms of routine birth control. You should take it only when all other forms of birth control have failed or were ineffective. Use of emergency contraceptive pills may be appropriate in the following circumstances:<\/p>\n\n\n\n<ul>\n<li>Failure of the birth control method (a broken condom, forgotten birth control pill or missed dose of birth control shot).<\/li>\n\n\n\n<li>If you have experienced non-consensual sex.<sup>4<\/sup><\/li>\n\n\n\n<li>If you had sex without using any form of birth control around the date of ovulation.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>Your cycle may be delayed\/early\/heavy\/irregular due to the emergency contraceptive pill. Get a <a href=\"https:\/\/askpinkypromise.com\/faq\/pregnancy\/when-can-i-take-a-pregnancy-test\/\" target=\"_blank\" rel=\"noreferrer noopener\">pregnancy test<\/a> if your period is delayed for more than two weeks from the expected date after using the emergency contraceptive pill. <\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>Do emergency contraceptive pills work during ovulation?<\/strong><\/h2>\n\n\n\n<p>Emergency contraceptive pills primarily work by preventing the ovary from releasing an egg (ovulation) in order to avoid pregnancy. Ovulation is a natural aspect of the female reproductive cycle. The release of an egg from the ovaries during this stage allows sperm to fertilise it and start the process of embryonic development. If you do not ovulate, there will be no egg to be fertilised by the sperm. Hence, you will not get pregnant. There have also been studies which state that emergency contraceptive pills might stop sperm and egg from fusing together (fertilisation) or that these pills could also prevent a fertilised egg from attaching to the womb (implantation) if fertilisation does take place. However, how emergency contraceptive pills prevent fertilisation and implantation is not clear yet.<sup>5<\/sup>&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>What are the <\/strong><strong>side effects of emergency contraceptive pills<\/strong><strong>?<\/strong><\/h2>\n\n\n\n<p>If you are going to take the <a href=\"https:\/\/askpinkypromise.com\/faq\/emergency-contraception\/when-can-i-take-the-emergency-contraceptive-pill\/\" target=\"_blank\" rel=\"noreferrer noopener\">morning-after pill<\/a>, here is why you should know about the side effects. Although the common complications of emergency contraceptive pills are short-term and usually go away within a few days, these do tend to affect your hormones and periods for a few cycles. The common side effects of morning-after pills are similar to that of the <a href=\"https:\/\/askpinkypromise.com\/faq\/contraception\/what-are-the-side-effects-of-birth-control-pills\/\" target=\"_blank\" rel=\"noreferrer noopener\">side effects of birth control pills<\/a>. In case they persist for a longer time, contact your doctor.<sup>6<\/sup><\/p>\n\n\n\n<p>The following are common minor side effects of emergency contraceptive pills:&nbsp;<\/p>\n\n\n\n<ul>\n<li>Nausea<\/li>\n\n\n\n<li>Vomiting<\/li>\n\n\n\n<li>Fatigue<\/li>\n\n\n\n<li>Dizziness<\/li>\n\n\n\n<li>Headache<\/li>\n\n\n\n<li>Lower abdominal pain or cramps<\/li>\n\n\n\n<li>Sore or tender breasts<\/li>\n\n\n\n<li>Heavy menstrual bleeding or bleeding between periods &nbsp;<sup>7<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>You are likely to also have other symptoms like:&nbsp;<\/p>\n\n\n\n<ul>\n<li><strong>Spotting &#8211;<\/strong> You may have some spotting within the next week of taking the emergency contraceptive pill. Also, your next period can be lighter or heavier, earlier or delayed than usual. Although if the bleeding seems very heavy and doesn’t stop, call your doctor. Altered periods may persist for a few cycles.<br><\/li>\n\n\n\n<li><strong><a href=\"https:\/\/askpinkypromise.com\/faq\/periods\/why-periods-are-irregular\/\" target=\"_blank\" rel=\"noreferrer noopener\">Irregular menstrual cycle<\/a> &#8211;<\/strong> Due to the emergency contraceptive pill, your period may arrive a little early or late, which is normal. However, you should take a pregnancy test if you do not get your period within two weeks of the expected date.<sup>8<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading has-medium-font-size\"><strong>How long do the <\/strong><strong>side effects of emergency contraceptive pills<\/strong><strong> last?<\/strong><\/h3>\n\n\n\n<p>Emergency contraceptive pills (ECP) usually do not have very severe or long-term side effects. All the side effects of ECPs should usually get resolved in a few days or weeks. If this is not the case, please see a doctor.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-medium-font-size\"><strong>How effective is the emergency contraceptive pill?<\/strong><\/h3>\n\n\n\n<p>If taken within 72 hours of having unprotected sex, emergency contraceptive pills can reduce the risk of pregnancy by up to 87% (when taken as directed).<sup>9<\/sup> When determining the effectiveness of the emergency contraceptive pill in preventing pregnancy, it is critical to consider the time gap between unprotected sex and taking the pill. Emergency contraceptive pills work effectively for only up to 72 hours or three days after having unprotected sex. But the effectiveness goes on reducing within 72 hours too, hence the sooner you take the emergency contraceptive pill, the more likely it is to prevent pregnancy. Despite the name &#8220;morning-after pill,&#8221; you don&#8217;t need to wait until the next day to take these pills.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-medium-font-size\"><strong>Are emergency contraceptive pills harmful?<\/strong><\/h3>\n\n\n\n<p>While the emergency contraceptive pill is a viable option for avoiding pregnancy during unprotected sex, it is not advised for regular use because it is not as effective as other forms of regular contraception. Also, the emergency contraceptive pill does not protect against <a href=\"https:\/\/askpinkypromise.com\/faq\/sexually-transmitted-infections\/what-is-the-main-cause-of-std\/\" target=\"_blank\" rel=\"noreferrer noopener\">sexually transmitted infections<\/a> (STIs).<\/p>\n\n\n\n<p>Not everyone is advised to use emergency contraceptive pills. Avoid taking the emergency contraceptive pill if:<\/p>\n\n\n\n<ul>\n<li>You have an allergy to one or more ingredients of the emergency contraceptive pill.<\/li>\n\n\n\n<li>You&#8217;re taking a medicine that can make the emergency contraceptive pill less effective. Such as Omeprazole or other antacids or some antibiotics such as Rifampicin.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>There are some indications that the emergency contraceptive pill won&#8217;t work as well to prevent pregnancy in obese or overweight people as it does for women who aren&#8217;t obese.<sup>10<\/sup><\/p>\n\n\n\n<h4 class=\"wp-block-heading has-medium-font-size\"><strong>Is it possible to <\/strong><strong>get pregnant after taking the morning-after pill?<\/strong><\/h4>\n\n\n\n<p>Yes, it is possible to become pregnant after taking the morning-after pill. Firstly, the morning-after pill has a failure rate of up to 10-13% even if it is taken correctly as directed within 72 hours. Secondly, the pill will protect you only from sexual intercourse that may have occurred up to 72 hours before taking the pill. If you take the pill after 72 hours of having unprotected sex, it may not help you avoid pregnancy.<sup>11<\/sup>&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading has-medium-font-size\"><strong>How to know if the morning-after pill has worked?<\/strong><\/h4>\n\n\n\n<p>The only way to know if the morning-after pill has worked is when you get your next period. If your period is delayed for more than two weeks from the expected date, after using the emergency contraceptive pill, get a pregnancy test. Taking a test right after taking the morning-after pill will be ineffective. This is because there will be insufficient human chorionic gonadotropin (hCG) in the body at this stage to show up on the pregnancy test. The level of hCG in your body will begin to rise in a week and a pregnancy test measures this. You can take a pregnancy test on the first day of your missed period, but if it comes out negative and your period hasn&#8217;t arrived after a week, you should test again. This time opt for a more accurate test such as a blood test.<sup>12<\/sup><\/p>\n\n\n\n<h4 class=\"wp-block-heading has-medium-font-size\"><strong>What are the signs that the morning-after pill has not worked?<\/strong><\/h4>\n\n\n\n<p>If you take the emergency contraceptive pill right after having unprotected sex, it can be very effective. The longer you wait to use the emergency contraceptive pill, the less effective it is. Only a missed period can indicate that an emergency contraceptive pill has not worked. There are no other markers before that. Take a pregnancy test if your period does not start within two weeks from the expected date.&nbsp;<\/p>\n\n\n\n<h4 class=\"wp-block-heading has-medium-font-size\"><strong>Can emergency contraceptive pills cause infertility?<\/strong><\/h4>\n\n\n\n<p>An emergency contraceptive pill (ECP) will not interfere with your fertility or prevent you from getting pregnant in the future. However, using ECPs more than once or frequently may cause disruption of your hormones and hence your <a href=\"https:\/\/askpinkypromise.com\/faq\/periods\/how-do-periods-work-the-menstrual-cycle-explained\/\" target=\"_blank\" rel=\"noreferrer noopener\">period cycle<\/a>.<\/p>\n\n\n\n<p>Having said that, women should not be afraid to use an ECP to avoid an unwanted pregnancy when they believe it is necessary. But since an ECP is less successful at preventing pregnancy than birth control methods like the IUD, patch, pill, ring, or shot, it is not advised as a long-term method of birth control. Additionally, regular ECP use may make periods unpredictable and irregular.<sup>13<\/sup><\/p>\n\n\n\n<h4 class=\"wp-block-heading has-medium-font-size\"><strong>How many times can I use emergency contraceptive pills?<\/strong><\/h4>\n\n\n\n<p>There is no cap on how many times you can use the emergency contraceptive pill. There are no major long-term side effects to the pill. But doctors often recommend not using these pills as a regular form of birth control. This is generally because of the higher amount of hormones in emergency contraceptive pills that may lead to issues with the period cycle.<sup>14<\/sup><\/p>\n\n\n\n<h4 class=\"wp-block-heading has-medium-font-size\"><strong>Does one need to consult a doctor?<\/strong><\/h4>\n\n\n\n<p>In most cases, you don&#8217;t need to contact your doctor before\/after taking the <a href=\"https:\/\/askpinkypromise.com\/faq\/emergency-contraception\/when-can-i-take-the-emergency-contraceptive-pill\/\" target=\"_blank\" rel=\"noreferrer noopener\">emergency contraceptive pill<\/a>. However, contact a doctor if you experience severe side effects, miss your period or experience significant lower abdomen pain three to five weeks after using the emergency contraceptive pill, bleeding, or spotting that lasts longer than a week. These could signify a miscarriage or the fertilised egg implanting outside of the uterus, typically in a fallopian tube (ectopic pregnancy).<\/p>\n\n\n\n<p>It&#8217;s also crucial to keep in mind that taking the emergency contraceptive pill does not protect you from sexually transmitted infections (STIs). Contact your doctor if you have any doubts about the possibility of being exposed to an STI.<sup>15<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\">    <img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"597\" class=\"wp-image-1416\" style=\"width: 480px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-are-the-side-effects-of-emergency-contraceptive-pills_.png\" alt=\"side effects of emergency contraceptive pills- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-are-the-side-effects-of-emergency-contraceptive-pills_.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-are-the-side-effects-of-emergency-contraceptive-pills_-300x166.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-are-the-side-effects-of-emergency-contraceptive-pills_-1024x566.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-are-the-side-effects-of-emergency-contraceptive-pills_-768x425.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[10],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1319"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1319"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1319"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}