{"id":1361,"date":"2022-01-31T14:35:44","date_gmt":"2022-01-31T09:05:44","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1361"},"modified":"2023-02-16T14:10:06","modified_gmt":"2023-02-16T08:40:06","slug":"what-to-do-if-im-experiencing-false-labour-pain","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/pregnancy\/what-to-do-if-im-experiencing-false-labour-pain\/","title":{"rendered":"What to do if I&#8217;m experiencing false labour pain?"},"content":{"rendered":"\n<p>False labour pain, also known as “Braxton Hicks contractions”, is often experienced by pregnant women, before they get real labour contractions. Often these Braxton Hicks contractions come in as early as the fourth month, to as late as the third trimester of pregnancy, close to your due date. These contractions are your body’s way of getting ready for the real thing, i.e., the day you give birth.&nbsp;<\/p>\n\n\n\n<p>Since it can be very confusing for anyone, to understand if what they are experiencing is a false alarm or a true labour contraction, here is what you need to know to understand false labour pain symptoms, and seek medical advice if needed!&nbsp;<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What does false labour feel like?&nbsp;<\/strong><\/p>\n\n\n\n<p>Some women say false labour feels like a tightening of their abdomen that comes and goes. It is usually not associated with any pain. Others claim that they resemble light menstruation pains. Although unpleasant, Braxton Hicks contractions don&#8217;t begin labour or open the cervix.<sup>1<\/sup> The strength of false labour contractions can fluctuate, feeling strong one second and weak the next. They don&#8217;t show up in a predictable pattern. If you walk or change positions, they can soften or suddenly stop. False contractions typically decrease and disappear over time.<sup>2<\/sup>&nbsp;<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What are the causes of false labour?&nbsp;<\/strong><\/p>\n\n\n\n<p>The most common cause of Braxton Hicks contractions is physical activity, tiredness, or dehydration. Other causes include &#8211; an illness that leads to vomiting or diarrhea, movement of the fetus, the mother&#8217;s activities, particularly lifting something or having sexual intercourse.<sup>3<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How do I know if it’s false labour?&nbsp;<\/strong><\/p>\n\n\n\n<p>Firstly, and most importantly, false labour pain or BH contractions are usually painless or very mild. True labour pains are painful and intensify over time, and contractions come faster and faster. They come at regular intervals and last for 30 to 70 seconds. Additionally, the contractions also become more closely spaced with one another as time progresses. False labour pain does not intensify with time and the contractions also do not become more closely spaced out over time.<sup>4<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>What is the difference between true labour and false labour?<\/strong><\/p>\n\n\n\n<p>The biggest difference between false contractions and true labour contractions is that in the case of false labour pains it often feels like your abdomen is tightening but there is almost no or just mild pain but in the case of true labour pains, the contractions slowly become more and more intense, and the time difference between one contraction and another gradually becomes lesser and lesser. Start timing your contractions and if you see the above pattern, you know it&#8217;s the real deal and you should probably start making plans to head to the hospital!<\/p>\n\n\n\n<p>At first, true labour contractions can feel like terrible <a href=\"https:\/\/askpinkypromise.com\/faq\/periods\/what-is-it-like-to-have-periods\/\" target=\"_blank\" rel=\"noreferrer noopener\">menstrual cramps<\/a> but quickly, one can realise that there is some activity in the cervical region as well. True labour pain symptoms include mucus plug release, water breaking, dull aches in the lower abdomen, pelvis, back, sides and thighs, etc. They vary in their exact nature from person to person. Also, the false labour pains subside when you do things like changing your position, moving, getting rest or getting a glass of water but true labour pains do not subside.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How long do false labour pains last?&nbsp;<\/strong><\/p>\n\n\n\n<p>False labour pain lasts contractions typically last for about 15 to 30 seconds, but they can also extend up to two minutes.<sup>5<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Why does false labour happen at night?<\/strong><\/p>\n\n\n\n<p>The primary hormone that causes your uterine muscle to contract is oxytocin, which you may be familiar with as oxytocin is also known as the ‘love hormone’. In many ways, oxytocin and melatonin are complementary hormones. Melatonin synergizes with Oxytocin to enhance the contractility of the uterine muscle. And since the brain only releases melatonin in the dark, it&#8217;s fascinating to think of it as the leader of the nighttime contraction-inducing chemicals. Contractions increase as oxytocin and melatonin levels rise at night.<\/p>\n\n\n\n<p>As oxytocin&#8217;s companion hormone, melatonin makes oxytocin more effective at causing more frequent contractions.<\/p>\n\n\n\n<p>Your body begins to create more melatonin and oxytocin as your pregnancy draws to a close, and the uterine muscle also develops more melatonin and oxytocin receptors. This implies that as the due date draws closer, your uterus will not only be bathed in more melatonin and oxytocin during those final few weeks of pregnancy, but it will also be better able to react to it.<sup>6<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Can labour start while sleeping?&nbsp;<\/strong><\/p>\n\n\n\n<p>In one simple word, the answer is yes! Labour can occur at any time, when you are in the shower, at work, or at a doctor&#8217;s appointment. Your body cannot stop labour from occurring under any circumstances. Also, it&#8217;s very common for labour to begin in the middle of the night while you are sleeping. The same melatonin theory explained above applies here too!&nbsp;<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Does lying down slow labour?&nbsp;<\/strong><\/p>\n\n\n\n<p>According to the research, women in industrialised nations typically lie in bed during labour, probably because that position makes it simpler for doctors to keep track of both the development of labour and the baby&#8217;s health. However, when a pregnant woman lies down, the weight of her growing belly presses against her abdominal blood vessels. Her contractions might become less intense as a result of that pressure, which might slow down her vagina&#8217;s dilatation and the baby&#8217;s descent through the birth canal.<\/p>\n\n\n\n<p>According to a study, moving about may help a woman feel more in control or distract her from the discomfort of her contractions. Both of these characteristics may reduce her need for pain medication. The majority of women can move freely during the early phases of giving birth, standing up or walking around as they like. Women should be encouraged to utilise whichever positions feel most comfortable to them, but they should specifically avoid lying down.<sup>7<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>How long after false labour is true labour?&nbsp;<\/strong><\/p>\n\n\n\n<p>False labour pain, often known as Braxton Hicks contractions, can begin weeks or months before true labour actually begins. They happen as your uterine muscles get ready to give birth. Although false labour contractions are mildly painful, they usually last a short time and are less intense than those experienced during true labour.<\/p>\n\n\n\n<p>Contrarily, true labour contractions are more frequent, more intense, and can last for more than a minute. Timing contractions can be helpful for you to anticipate whether what you are experiencing is true labour or just false labour contractions.<sup>8<\/sup><\/p>\n\n\n\n<p>Start timing your contractions when you believe you are actually in labour. To do this, note the beginning and ending times of each contraction on paper or have someone else do it for you. This is the duration. Also, note the time between two contractions. This is called the interval.<\/p>\n\n\n\n<p>In general, mild contractions start 15 to 20 minutes apart and last 60 to 90 seconds. Contractions grow more regular, eventually being less than 5 minutes apart. Strong contractions that last 45 to 60 seconds and happen every 4 to 5 minutes are typically indicative of active labour, which is the time you should go to the hospital.<sup>9<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Where do labour pains start?&nbsp;<\/strong><\/p>\n\n\n\n<p>False labour pain is frequently felt only in the front of your belly or pelvis. While true labour pain may begin in the lower back and progress to the front of the abdomen. Alternatively, they could even begin in your abdomen and progress to your back.<sup>10<\/sup> True labour is accompanied by the cervical plug coming out in what is known as ‘bloody show’. The cervical plug (or mucus plug) is a clump of mucus which forms early in the pregnancy to create a protective barrier between the baby and the vagina and beyond! When it&#8217;s time for your baby to come out, the cervical plug will fall out, which means that your cervix is dilating and preparing itself for your baby to come out through it! <sup>11<\/sup><\/p>\n\n\n\n<p>False pain in pregnancy is commonly experienced, especially by second (and more) time moms! You don’t have to worry about these contractions but you can try drinking water or taking a walk (since movement often stops false labour contractions), taking a nap, or resting for some time by listening to music. You could also get a massage or relax by taking a warm bath. However, you must call your doctor if you are having any vaginal bleeding, experiencing strong contractions that are taking on the nature of true labour pains, if your water breaks, or if you have contractions that make even walking difficult.<sup>12<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p> <\/p>\n\n\n\n<p>                         <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\">   <img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"1080\" class=\"wp-image-1398\" style=\"width: 350px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/4.png\" alt=\"false labour pain- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/4.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/4-300x300.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/4-1024x1024.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/4-150x150.png 150w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/4-768x768.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[65],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1361"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1361"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}