{"id":1363,"date":"2022-01-31T14:44:36","date_gmt":"2022-01-31T09:14:36","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1363"},"modified":"2022-09-19T17:00:56","modified_gmt":"2022-09-19T11:30:56","slug":"can-having-protected-sex-delay-periods","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/periods\/can-having-protected-sex-delay-periods\/","title":{"rendered":"Can having protected sex delay periods?"},"content":{"rendered":"\n<p>No, having protected sex cannot delay your periods. Having protected sex or even sex for that matter does not delay your periods. There’s as such nothing that can affect your periods, unless you are pregnant or have other issues which can delay them. Had you used the condom correctly and without any problems the whole time you were having sex, it is very unlikely that you are pregnant. Merely having sex will not change your hormonal balance in such a way as to alter your periods. Therefore, it is important to understand some of the most common reasons for delayed periods:&nbsp;<\/p>\n\n\n\n<p><strong>1.<\/strong> <strong>Pregnancy:<\/strong><\/p>\n\n\n\n<p>For sexually active women whose periods are late, there is a possibility that they might be pregnant. Missing a period is a sure shot sign of pregnancy. So if you did have unprotected sex or your contraception failed by any chance, then there is a possibility that you might get pregnant. The endometrium (uterine lining) is one of the main constituents of period fluid that sheds along with blood and other components. Every month the endometrium (inner uterine lining) is formed in order to prepare itself for carrying a baby during pregnancy. If the egg gets fertilised, the endometrium thickens in size and provides the fertilised egg a soft surface for implantation. If there is no fertilised egg, the endometrium sheds out along with blood and other period fluid. When the fertilised egg sticks itself to the walls of the uterus, it is confirmed that you are pregnant. Once the pregnancy takes place, the endometrium then becomes placenta, later on from which the umbilical cord develops. Placenta performs the role of providing the required nutrition and oxygen to the growing baby in the womb.<sup>1<\/sup><\/p>\n\n\n\n<p><strong>2.<\/strong> <strong>Polycystic Ovary Syndrome (PCOS):<\/strong><\/p>\n\n\n\n<p>Polycystic Ovary Syndrome also known as PCOS, is a condition where one may experience irregular periods, failure to ovulate, a higher than normal level of male hormones and outwardly symptoms like hair fall, acne, male pattern baldness and so on.<sup>2<\/sup> A missed period is often one of the most tell-tale sign of PCOS.<sup>3<\/sup><\/p>\n\n\n\n<p><strong>3.<\/strong> <strong>Stress and lifestyle changes:<\/strong><\/p>\n\n\n\n<p>Excessive stress or even just stress can have a significant impact on the menstrual cycles as well as blood flow. Stress is a mental health condition and the gland responsible for controlling the hormones which in turn is responsible for regulating periods (called the hypothalamus), is also situated in the brain. Therefore, with increase in stress, the impact on the hypothalamus also increases. This further leads to hormonal imbalance, resulting in late periods. Lifestyle changes like not sleeping enough, or having poor eating habits, can also affect the hypothalamus in a similar way.<\/p>\n\n\n\n<p><strong>4.<\/strong> <strong>Sudden weight loss or over exercising:<\/strong><\/p>\n\n\n\n<p>Hitting the gym a bit too much? Intense workout and diets can be one of the reasons why you may be experiencing missed or late periods. It has a great impact on the hormones that regulate the period in the body. Exercising to lose weight and a calorie deficit diet is associated with a calorie burn. Similarly, overdoing both can result in excessive loss of calories and body fat. This loss can also include the calories\/energy that your body actually needs in order to function. Without sufficient energy the performance of the body will start slowing down along with the reproductive functions. According to the NHS of the UK, losing too much body fat through intense exercise can also stop you from ovulating.<sup>4<\/sup><\/p>\n\n\n\n<p>Delay in periods is also a common thing found in teens those who have recently attained puberty. For the first few years, your periods might come late or even earlier than usual. However, if you want to be 100% sure that you aren’t pregnant, you can take a pregnancy test at home. For all other reasons, it&#8217;s important to consult a gynaecologist who can help you further.<sup>5<\/sup>         <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"707\" class=\"wp-image-1480\" style=\"width: 500px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/Can-having-protected-sex-delay-periods_.png\" alt=\"can sex delay your period\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/Can-having-protected-sex-delay-periods_.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/Can-having-protected-sex-delay-periods_-300x196.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/Can-having-protected-sex-delay-periods_-1024x670.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/01\/Can-having-protected-sex-delay-periods_-768x503.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[15],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1363"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1363"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1363"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}