{"id":1516,"date":"2022-04-21T19:53:58","date_gmt":"2022-04-21T14:23:58","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1516"},"modified":"2023-02-13T11:17:39","modified_gmt":"2023-02-13T05:47:39","slug":"what-are-daily-oral-contraceptive-pills","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/contraception\/what-are-daily-oral-contraceptive-pills\/","title":{"rendered":"What are daily oral contraceptive pills?"},"content":{"rendered":"\n<p>There are various birth control or contraception options available in the form of pills, patches, barriers (like condoms), and so on. One such popular option is the &#8216;Daily Oral Contraceptive Pills&#8217;, called such since a woman has to take this pill every day, orally (by mouth) to prevent pregnancy. Daily oral contraceptive pills are sometimes also referred to as birth control pills. These pills contain small amounts of hormones that help you from becoming pregnant.&nbsp;<\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What are the types of daily oral contraceptive pills?<\/strong><\/h2>\n\n\n\n<p>There are two types of birth control pills\/daily oral contraceptive pills &#8211; progestin-only pills (or mini pill), which contains the synthetic version of progesterone, and the Combined Oral Contraceptive Pill (COCP), which contains both estrogen and progesterone. There are various synthetic variants of estrogen and progesterone which in addition to birth control, also provide relief from issues like acne, hair fall, overly painful and heavy periods, and so on. The COCP is the most commonly used form of birth control pill among COCP and Mini Pill. However, in some circumstances including if you are in the first six weeks of breastfeeding, you are a smoker, have a history of blood clots and heart diseases and so on, the estrogen in the COCP may not be recommended for you. In that case, your doctor will prescribe a mini-pill.<\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>How do the daily oral contraceptive pills work?<\/strong><\/h2>\n\n\n\n<p>As we read above, oral contraceptive pills contain hormones which it releases into your body. Furthermore, these hormones stop the release of an egg from the ovary (also known as ovulation). If there is no ovulation, fertilization (sperm merging with an egg) will also not happen, and hence no chance of you being pregnant. The hormones of the pill also thicken the mucus on the cervix and act as a guard, preventing the sperm from swimming to the egg. In this way, the contraceptive oral pills help in birth control.&nbsp;<\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>How effective are the daily oral contraceptive pills?<\/strong><\/h3>\n\n\n\n<p>The daily oral contraceptive pill is 99% effective, provided that you take it every day at the same time consistently. You are required to take the pill at the same time every day in order to keep your body from ovulating. Following this will reduce the chances of your pregnancy to a great extent.&nbsp;&nbsp;<\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>What are the side effects of daily oral contraceptive pills?<\/strong><\/h3>\n\n\n\n<p>While daily oral contraceptive pills are generally safe, they do have some risks and side effects. Hormones in daily oral contraceptive pills affect everyone differently. Reduced sex drive, nausea, headaches, spotting or bleeding between periods, breast tenderness, abdominal cramping, and an increase in vaginal discharge are all common <a href=\"https:\/\/askpinkypromise.com\/faq\/contraception\/what-are-the-side-effects-of-birth-control-pills\/\" target=\"_blank\" rel=\"noreferrer noopener\">side effects birth control pills<\/a>\/ daily oral contraceptive pills.<\/p>\n\n\n\n<p>If you&#8217;re experiencing these side effects, they&#8217;ll probably go away within a few months since you have started taking the pill. You should consult your doctor if they do not improve. They might advise you to try a different birth control pill.<\/p>\n\n\n\n<h4 class=\"has-medium-font-size wp-block-heading\"><strong>Am I protected against Sexually Transmitted Infections (STIs\/STDs)?<\/strong><\/h4>\n\n\n\n<p>Remember that the pills only protect against pregnancy and not STIs. If you want yourself and your partner to be safe from STIs, it is best to use condoms! Condoms along with the pill will help you to protect against both &#8211; STIs and pregnancy! <sup>1<\/sup> <sup>2<\/sup><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><\/h2>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"704\" class=\"wp-image-1517\" style=\"width: 500px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/04\/Images-for-website-FAQs-3.png\" alt=\"daily oral contraceptive pills- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/04\/Images-for-website-FAQs-3.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/04\/Images-for-website-FAQs-3-300x196.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/04\/Images-for-website-FAQs-3-1024x668.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/04\/Images-for-website-FAQs-3-768x501.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[9],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1516"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1516"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1516"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}