{"id":1564,"date":"2022-05-03T17:11:28","date_gmt":"2022-05-03T11:41:28","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1564"},"modified":"2023-04-12T13:27:46","modified_gmt":"2023-04-12T07:57:46","slug":"what-are-the-symptoms-of-urinary-tract-infection","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/uti\/what-are-the-symptoms-of-urinary-tract-infection\/","title":{"rendered":"What are the symptoms of urinary tract infection?"},"content":{"rendered":"\n<p>Symptoms of urinary tract infection (UTI) includes a burning sensation while peeing, frequently feeling a strong urge to pee, pelvic pain in women while peeing, and so on. All of these are considered as the common symptoms of urinary tract infection (UTI). A UTI is a broad term given to an infection that can take place in any part of the urinary system. Your urinary system includes kidneys, bladder, ureters and urethra. A UTI most commonly affects the bladder and the urethra. In fact, women are anatomically at a higher risk of catching a UTI because a women&#8217;s urethra is shorter than a man’s, making it easy for bacteria to easily climb up and cause an infection.<\/p>\n\n\n\n<p>However, not all the signs and symptoms of urinary tract infection are as clearly visible. Some other common symptoms of a UTI include:&nbsp;<\/p>\n\n\n\n<ul>\n<li>increase in the urge to pee<\/li>\n\n\n\n<li>increased frequency to pee without passing much urine<\/li>\n\n\n\n<li>dark brown\/cola coloured pee<\/li>\n\n\n\n<li>urine that appears blood like<\/li>\n\n\n\n<li>pee that has a stronger odour<\/li>\n\n\n\n<li>women experiencing pelvic pain while peeing <sup>1<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>UTIs are common among pregnant women and affect between 2% to 10% of pregnant women. The symptoms of a UTI during pregnancy are similar to the common signs and symptoms of UTI. UTIs are more likely to occur during pregnancy in women who have previously had them and are more likely to spread to the kidneys. If you are pregnant and suspect you may have a UTI, please contact your doctor right away!<\/p>\n\n\n\n<p>Urinary tract infections confined to the bladder can be extremely painful and make you uncomfortable. However, UTIs can cause serious health effects if they spread to your kidneys. Therefore, taking care of a UTI is really important!<\/p>\n\n\n\n<p>In order to determine if you have a UTI or not, there are two most common tests. A urine routine urine test and a urine culture test. Both of these tests are conducted with the help of a urine sample. The urine routine test helps to determine if you have an infection or not. Furthermore, the urine sample is used for carrying out a urine culture test. The urine culture test helps to understand if the infection is resistant to any antibiotics.<\/p>\n\n\n\n<p>Generally, antibiotics are prescribed to <a href=\"https:\/\/askpinkypromise.com\/faq\/uti\/how-to-treat-urinary-tract-infection\/\" target=\"_blank\" rel=\"noreferrer noopener\">treat a urinary tract infection<\/a> in the early stage. However, what medication to prescribe and for how long depends upon the type and severity of infection. After analysing the type of bacteria and what antibiotics it is resistant to, it is determined which antibiotics should be prescribed for the treatment. <sup>2<\/sup>&nbsp;<\/p>\n\n\n\n<p>Sometimes, UTI may not entirely go away and show up again and again. If you are infected with a UTI for 3 or more than 3 times in a span of 12 months, then you could be having a recurrent UTI or a chronic UTI. Recurrent UTI may not respond to the antibiotics given for normal UTI. Recurrent UTI hence requires a slight different method of treatment than normal UTI. Your doctor may recommend you a longer course of antibiotics or even hospitalisation in the worst case. <sup>3<\/sup>     <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"710\" class=\"wp-image-1565\" style=\"width: 530px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/Images-for-website-FAQs-4.png\" alt=\"symptoms of urinary tract infection- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/Images-for-website-FAQs-4.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/Images-for-website-FAQs-4-300x197.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/Images-for-website-FAQs-4-1024x674.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/Images-for-website-FAQs-4-768x505.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[12],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1564"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1564"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1564"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}