{"id":1857,"date":"2022-05-31T19:13:13","date_gmt":"2022-05-31T13:43:13","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1857"},"modified":"2022-07-15T19:23:42","modified_gmt":"2022-07-15T13:53:42","slug":"how-do-polycystic-ovaries-affect-pregnancies","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/polycystic-ovaries\/how-do-polycystic-ovaries-affect-pregnancies\/","title":{"rendered":"How do polycystic ovaries affect pregnancy?"},"content":{"rendered":"\n<p>PCOS or polycystic ovary syndrome can play a role in influencing your ability to conceive and carry your pregnancy to completion. However, thanks to a heightened understanding in the medical community of how to help women with PCOS to conceive as well as have a safe and happy pregnancy, you have many options for you. According to Cleveland Clinic, PCOS is very common — up to 15% of women of reproductive age have it. PCOS is a common condition among women of reproductive age which is caused due to hormonal imbalances. It can happen to women at any age after she’s hit her puberty phase.<sup>1<\/sup><\/p>\n\n\n\n<p>Polycystic ovaries affect pregnancy for the same reasons that helps to determine whether one has PCOS or not. Women with PCOS have ovaries larger than the normal size. These enlarged ovaries contain many tiny fluid filled sacs which are nothing but eggs which never matured to a size large enough to be released through the process of ovulation. Higher levels of androgen production in women, which is commonly found in the case of those with PCOS, also affects the development and release of an egg. Hence, this altogether prevents ovulation and causes irregular menstrual cycles or sometimes even absent menstrual cycles. Ovulation is the process of releasing a mature egg from the ovaries. This eventually affects fertilisation which will also not take place if there’s no mature egg to meet the sperm. This is the reason why PCOS affects the chances of getting pregnant.&nbsp;&nbsp;<\/p>\n\n\n\n<p>A woman with PCOS can no doubt get pregnant if she has been managing it well from an early stage. But let’s not overlook the various complications PCOS may bring along with pregnancy.<\/p>\n\n\n\n<p>Premature birth, miscarriage, bigger than normal sized babies, complication during labour, delivery, etc are somethings that mom-to-be with PCOS may face. The chances of miscarriage are 3 time more for women who have PCOS than to the ones who don’t have it.<sup>2<\/sup><\/p>\n\n\n\n<p>You can easily manage PCOS and reduce its effect in the long run just with the help of certain healthy lifestyle changes. Adapting required nutritional diet, regular exercise, maintaining accurate weight and balancing blood sugar levels can help the management of PCOS. Often, doctors also prescribe birth control pills to control the androgen levels as well as to counteract some of the other symptoms of PCOS like acne, hair fall etc. When on birth control, one cannot get pregnant.<\/p>\n\n\n\n<p>Ovulation induction is one of the most common ways to help someone with PCOS get pregnant, especially if the PCOS isn’t severe and when ovulation is the only issue. In this, with the help of hormonal medication either administered orally or through injections, women can ovulate and then get pregnant with timed intercourse to coincide with ovulation.<sup>3<\/sup><\/p>\n\n\n\n<p>The next option for women with PCOS to get pregnant is via IVF &#8211; In Vitro fertilisation. In this procedure, a man’s sperm and a woman’s eggs are taken, combined and fertilised in a laboratory. Once the egg gets fertilised, it is then implanted in a woman’s uterus (uterine lining) for development.<sup>4<\/sup> <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"708\" class=\"wp-image-1858\" style=\"width: 450px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/How-do-polycystic-ovaries-affect-pregnancies_.png\" alt=\"polycystic ovaries affect pregnancy- pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/How-do-polycystic-ovaries-affect-pregnancies_.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/How-do-polycystic-ovaries-affect-pregnancies_-300x197.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/How-do-polycystic-ovaries-affect-pregnancies_-1024x671.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/05\/How-do-polycystic-ovaries-affect-pregnancies_-768x503.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[62],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1857"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1857"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1857"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}