{"id":1887,"date":"2022-06-08T19:46:19","date_gmt":"2022-06-08T14:16:19","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1887"},"modified":"2022-09-19T17:42:49","modified_gmt":"2022-09-19T12:12:49","slug":"why-periods-are-irregular","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/periods\/why-periods-are-irregular\/","title":{"rendered":"Why are periods irregular?"},"content":{"rendered":"\n<p>There are a variety of reasons why periods are irregular including stress, natural hormonal changes, starting or stopping birth control, excess weight gain or weight loss etc. Irregular periods, also known as oligomenorrhea, can be remedied once there is an understanding of their cause. The majority of reasons for irregular periods have something to do with hormone levels.<\/p>\n\n\n\n<p>The primary hormones that regulate the menstrual cycle are estrogen, progesterone, and follicle-stimulating hormone. Irregular periods suddenly can occur if something disturbs or changes the way these hormones rise and decrease during each cycle.<\/p>\n\n\n\n<p>Some of the causes of irregular periods are &#8211; stress, intense workout, sudden weight loss, natural hormonal changes, contraceptives, etc.<\/p>\n\n\n\n<p>Let us more closely examine the common causes of irregular menstrual cycles:<\/p>\n\n\n\n<p><strong>1. The onset of periods and menopause:<\/strong><\/p>\n\n\n\n<p>Menarche, or the time when someone first starts menstruating, and menopause, when someone stops menstruating, are both times where the body undergoes significant hormonal changes. During puberty, the effects of irregular periods on the body can be experienced since the body goes through a lot of changes during this time. The hormones that control periods can take several years to settle into a consistent pattern.&nbsp;<\/p>\n\n\n\n<p>During perimenopause, the earliest stage of&nbsp; menopause, periods become erratic as well. Hormone levels start to drop around this time. Periods may become longer and further apart until a person no longer has them.<\/p>\n\n\n\n<p><strong>2. Starting <a href=\"https:\/\/askpinkypromise.com\/faq\/contraception\/how-to-take-birth-control-pills\/\" target=\"_blank\" rel=\"noreferrer noopener\">Birth Control Methods<\/a>:<\/strong><\/p>\n\n\n\n<p>Hormonal contraception works by preventing ovulation. This means that while using it, a person does not have a genuine period. Instead, some women do not have a period at all, while others get withdrawal bleeding that resembles a period.<\/p>\n\n\n\n<p>During the first few months of using the pill, patch, implant, or hormonal intrauterine device (IUD), a person may experience irregular bleeding. It&#8217;s possible that this will become more regular overtime or that it will stop entirely.<\/p>\n\n\n\n<p><strong>3. Stopping Birth Control Methods:<\/strong><\/p>\n\n\n\n<p>Similarly, if a woman stops using hormonal birth control, her periods may become irregular. It takes some time for the body&#8217;s hormonal cycle to return to normal.<\/p>\n\n\n\n<p>People who had irregular periods before using hormonal birth control may experience them again once they stop using it.<\/p>\n\n\n\n<p><strong>4. Underlying Health Conditions:<\/strong><\/p>\n\n\n\n<p>Irregular period symptoms can sometimes be due to underlying health conditions like:<\/p>\n\n\n\n<ul><li><strong>PCOS &#8211; <\/strong>Polycystic ovarian syndrome (PCOS) is a disorder in which the ovaries develop tiny, fluid-filled sacs known as cysts. High testosterone levels caused by PCOS can hinder or postpone ovulation and a woman&#8217;s cycle.<\/li><\/ul>\n\n\n\n<ul start=\"2\"><li><strong>Eating disorders &#8211;<\/strong> There are several types of eating disorders that can result in absent or irregular periods, such as anorexia nervosa, bulimia nervosa, and binge eating disorders. Women who have lost a lot of weight are more likely to experience this.<\/li><\/ul>\n\n\n\n<ul start=\"3\"><li><strong>Endometriosis &#8211; <\/strong>Endometriosis is a disorder that occurs when cells that normally grow inside the uterus grow outside of it. The uterine lining, which thickens and dissolves with each menstrual cycle, is made up of these cells. This periodic thickening and shedding cause severe pain when the cells develop elsewhere.<\/li><\/ul>\n\n\n\n<ul start=\"4\"><li>&nbsp;<strong>Thyroid disease &#8211; <\/strong>Hormones produced by the thyroid have an impact on metabolism, heart rate, and other basic activities. It also aids in the regulation of ovulation and periods. Thyroid hormone production is excessive in hyperthyroidism, while it is insufficient in hypothyroidism. Periods can be heavy or light, and they can be more or less frequent as a result of thyroid disease. In some people, it might also cause ovulation to halt.<\/li><\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>Other irregular periods problems include &#8211; primary ovarian insufficiency, hormone-secreting tumours, Cushing’s syndrome, type 1 diabetes, etc.<sup>1<\/sup>       <\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"712\" class=\"wp-image-1889\" style=\"width: 500px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/Images-for-website-FAQs-6.png\" alt=\"\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/Images-for-website-FAQs-6.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/Images-for-website-FAQs-6-300x198.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/Images-for-website-FAQs-6-1024x676.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/Images-for-website-FAQs-6-768x507.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[15],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1887"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1887"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1887"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}