{"id":1926,"date":"2022-06-10T17:36:21","date_gmt":"2022-06-10T12:06:21","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=1926"},"modified":"2023-02-10T12:53:34","modified_gmt":"2023-02-10T07:23:34","slug":"how-to-take-birth-control-pills","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/contraception\/how-to-take-birth-control-pills\/","title":{"rendered":"How to take birth control pills?"},"content":{"rendered":"\n<p>Birth control pills are one of the birth control methods which can prevent pregnancy when taken consistently and in the prescribed manner.&nbsp; The manner in which you should take birth control pills is dependent on the type of birth control pill you&#8217;re taking. Dosing regimens differ by kind and brand. Birth control pills work by preventing ovulation, which is the release of an egg from the ovaries. If an egg is not released, then there is no fertilization with a sperm, and therefore no pregnancy!<\/p>\n\n\n\n<p>The pill does not have to be taken with food. However, it&#8217;s recommended not to take them on an empty stomach if you&#8217;re susceptible to nausea.<\/p>\n\n\n\n<p>You can choose a time of day that works for you so long as you follow the recommended dosing schedule for the type of pill that you are taking. This should be a convenient and easy-to-incorporate time into your schedule so you don&#8217;t forget.<sup>1<\/sup>&nbsp;<\/p>\n\n\n\n<p>Let&#8217;s have a look at the dosage information for each variety:<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>1. Combination pills or COCPs:<\/strong><\/h2>\n\n\n\n<p>Combination pills or COCPs are pills that contain a combination of 2 hormones &#8211; estrogen and progestin. They are considered the most common type of birth control pills.&nbsp;<\/p>\n\n\n\n<p>You will be protected from pregnancy if you take one pill every day. It is generally advised to take the pill at the same time every day, especially the more lower dose varieties like Dronis 20 and so on.<sup>2<\/sup><\/p>\n\n\n\n<p>The number of days you take a pill in a row is determined by the brand. This is because combination pills are available in a variety of dose packs ranging from 21 to 365 days.<\/p>\n\n\n\n<p>Most brands require you to take active pills for at least 3 weeks (usually 21 days) and then inactive pills for 2 to 7 days or no pills at all. These inactive pills are basically dummy pills and they don’t contain any hormones. Due to an absence of estrogen and progesterone when you take these inactive pills or don&#8217;t take pills for 7 days, your uterus will shed its layer of blood and you will get your periods (although because you aren’t ovulating, these aren’t really periods). This is known as cyclical dosing, and most people have a time during this week when they are not taking the active pills.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>There are also companies that provide:<\/strong><\/h2>\n\n\n\n<ul>\n<li><strong>Continuous dosing<\/strong> <strong>&#8211;<\/strong> This entails taking an active pill once a day instead of inactive pills.<\/li>\n<\/ul>\n\n\n\n<ul>\n<li><strong>Extended dosing &#8211; <\/strong>This entails taking three or four brief breaks per year, during which you take inactive tablets or no pills at all.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Here&#8217;s how to use birth control pills:<\/strong><\/h3>\n\n\n\n<ul>\n<li><strong>21-day pack<\/strong> &#8211; Take one pill per day for 21 days, then wait a week before beginning another pack. The week you don&#8217;t take the pill, you will get your periods.&nbsp;<\/li>\n<\/ul>\n\n\n\n<ul start=\"2\">\n<li><strong>28-day pack &#8211; <\/strong>Take one pill every day for 28 days and then begin a new pack on day 29. The first 21 or 24 pills, depending on the brand, include estrogen and progestin. The remaining tablets could be estrogen-only, inactive, or have a nutritional supplement in them. During this time, you should get a period.<\/li>\n<\/ul>\n\n\n\n<ul start=\"3\">\n<li><strong>91-day pack<\/strong> &#8211; Take one pill every day for 84 days with the 91-day pack. Depending on the manufacturer, the last 7 pills may be inactive or estrogen-only, which is when you&#8217;ll start getting your period. You only have a period every three months with this dose.<\/li>\n<\/ul>\n\n\n\n<ul start=\"4\">\n<li><strong>365-day pack<\/strong> &#8211; Take one pill per day for the full year. You shouldn&#8217;t get a period for the entire year if you take active pills every day.<sup>3<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>2. Progestin-only pills or POPs:<\/strong><\/h3>\n\n\n\n<p>Progestin-only pills or POPs are pills that contain only one type of hormone &#8211; progestin, the synthetic variant of progesterone, which is a sex hormone. These pills do not have estrogen and are also called mini-pills.<\/p>\n\n\n\n<p>To avoid pregnancy, you must take progestin-only pills at the same time within 3 hours every day. For example &#8211; If you had taken the pill at 12:00 pm, you are required to take the pill before 3 pm the next day. If you take the pill after 3:00 pm., it will increase your chance to get pregnant. Alarm clocks, reminders, and birth control apps can all help you remember to take your pill.<\/p>\n\n\n\n<p>Only 28-day (4-week) packs of progestin-only pills are available. Hormones are present in all 28 pills. To avoid pregnancy, you must take every pill in a progestin-only pack – there is no hormone-free week. Your period may arrive in the fourth week. You could also experience sporadic bleeding (spotting) or go without a period for the entire month.<sup>4<\/sup><\/p>\n\n\n\n<h4 class=\"has-medium-font-size wp-block-heading\"><strong>How to quit taking the pill?<\/strong><\/h4>\n\n\n\n<p>It is possible to stop taking birth control pills at any time, though stopping at the end of a pill pack is suggested. You may experience mild bleeding or spotting, and your periods may become irregular. Within two weeks, you should start ovulating again and can try for a baby.<sup>5<\/sup> Remember that birth control pills do not protect you against sexually transmitted diseases, so make sure to use a condom when you have sex. <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"715\" class=\"wp-image-1927\" style=\"width: 530px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/How-to-take-birth-control-pills.png\" alt=\"How to take birth control pills- pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/How-to-take-birth-control-pills.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/How-to-take-birth-control-pills-300x199.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/How-to-take-birth-control-pills-1024x679.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/06\/How-to-take-birth-control-pills-768x509.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/>  <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>&nbsp;<\/p>\n\n\n\n<p class=\"has-small-font-size\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[9],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/1926"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1926"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=1926"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}