{"id":2018,"date":"2022-07-20T16:20:43","date_gmt":"2022-07-20T10:50:43","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=2018"},"modified":"2023-03-04T09:01:56","modified_gmt":"2023-03-04T03:31:56","slug":"what-are-the-different-types-of-urinary-tract-infections","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/uti\/what-are-the-different-types-of-urinary-tract-infections\/","title":{"rendered":"What are the different types of urinary tract infections?"},"content":{"rendered":"\n<p>There are broadly 3 types of urinary tract infections depending upon which part of your urinary tract is infected:<\/p>\n\n\n\n<ul>\n<li>Cystitis &#8211; infection in the bladder<\/li>\n\n\n\n<li>Pyelonephritis &#8211; infection in the kidneys&nbsp;<\/li>\n\n\n\n<li>Urethritis &#8211; infection in the urethra&nbsp;<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>Before getting into the details of the types of UTI, let’s first understand the meaning and other significant things about UTI.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What is a urinary tract infection (UTI)?<\/strong><\/h2>\n\n\n\n<p>A urinary tract infection, often known as a UTI, is an infection that affects any portion of your urinary system, including your kidneys, bladder, and urethra.&nbsp;<\/p>\n\n\n\n<p>Bacteria or germs that are responsible for UTI aren&#8217;t usually seen in pee. Kidneys as a filtration mechanism produce urine in the form of a byproduct. Your kidneys produce urine when they remove waste items and excess water from your blood. Urine normally passes through your urinary system uncontaminated. Infections and inflammation can, however, be caused by bacteria entering the urinary system from outside the body. This bacterial infection in urine which takes place in the urinary tract causes UTI to develop.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>What comprises the urinary tract?<\/strong><\/h2>\n\n\n\n<p>The urinary tract produces and stores urine, which is one of the body&#8217;s waste products. The parts of the urinary tract are as follows:<\/p>\n\n\n\n<ul>\n<li>The <strong>kidneys<\/strong> are little organs placed right above the hips on the back of your body. They are your body&#8217;s filters, which remove wastes and water from your blood. This waste is transformed into urine<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>The kidneys send urine to the bladder through tiny tubes called <strong>ureters<\/strong><\/li>\n<\/ul>\n\n\n\n<ul>\n<li>The <strong>bladder <\/strong>is a sac-like container that retains urine before it leaves the body<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>The <strong>urethra <\/strong>transports urine from your bladder to the outside of your body <sup>1<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Types of Urinary Tract Infections:<\/strong><\/h2>\n\n\n\n<p>Infections can occur in several areas of the urinary tract. Each type has a distinct name depending on where it is located. The 3 common types of UTI along with their symptoms are as follows:<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>1. Cystitis (bladder):<\/strong> <\/h3>\n\n\n\n<p>In most cases, this form of UTI is caused by Escherichia coli (E. coli), a bacteria commonly found in the gastrointestinal (GI) tract. Other bacteria, though, are sometimes responsible.<\/p>\n\n\n\n<p>Although sexual activity can cause cystitis, it doesn&#8217;t require active sexual behaviour. All women are at risk of cystitis due to the short distance between the urethra and the anus and the urethral entry into the bladder.<\/p>\n\n\n\n<p>You may feel compelled to pee frequently or may experience that it hurts while you pee. Lower abdominal pain and cloudy or bloody urine are also <a href=\"https:\/\/askpinkypromise.com\/faq\/uti\/what-are-the-symptoms-of-urinary-tract-infection\/\" target=\"_blank\" rel=\"noreferrer noopener\">symptoms of UTI<\/a> in the bladder.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>2. Pyelonephritis (kidneys):<\/strong> <\/h3>\n\n\n\n<p>Fever, chills, nausea, vomiting, and discomfort in your upper back or side are all urinary tract infection symptoms of pyelonephritis (kidney infection).<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>3. Urethritis (urethra):<\/strong> <\/h4>\n\n\n\n<p>When GI bacteria travel from the anus to the urethra, this form of UTI occurs. Furthermore, because the female urethra is so close to the vagina, sexually transmitted illnesses like herpes, gonorrhea, chlamydia, and mycoplasma can induce urethritis. You may notice a discharge and a burning sensation when you pee. <sup>2 3<\/sup><\/p>\n\n\n\n<p>If you are worried you may have a UTI, download the Pinky Promise App for free symptom assessment on our gynaecologist verified chatbot. You can also talk about your problems anonymously in our chatrooms with other community members for free!<\/p>\n\n\n\n<p class=\"has-text-align-center\">    <img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"625\" class=\"wp-image-2442\" style=\"width: 450px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2021\/12\/What-are-the-different-types-of-urinary-tract-infections_.png\" alt=\"different types of urinary tract infections- ask pinky promise\"><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[12],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/2018"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=2018"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=2018"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}