{"id":2042,"date":"2022-07-20T19:05:54","date_gmt":"2022-07-20T13:35:54","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=2042"},"modified":"2023-05-05T13:06:09","modified_gmt":"2023-05-05T07:36:09","slug":"how-to-prevent-pregnancy","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/pregnancy\/how-to-prevent-pregnancy\/","title":{"rendered":"How to prevent pregnancy?"},"content":{"rendered":"\n<p>How to prevent pregnancy? You can prevent pregnancy<strong> <\/strong>by using a variety of contraception methods. In case you want to avoid pregnancy as well as Sexually Transmitted Infections (STIs), you can consider using a condom, which is the only form of birth control that can protect you from both. Here is a summary of methods used to prevent pregnancy:&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>1. Withdrawal method or “Pull Out” method<\/strong>:<\/h2>\n\n\n\n<p>One of the oldest methods of birth control is the “pull-out” method where a penis owner withdraws the penis (aka pulls out) just before they are about to orgasm. But this is also the most unreliable method of birth control with a failure rate of more than 20% which means one in five people practising this method end-up getting pregnant in a year!<sup>1<\/sup><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>2. Timed intercourse:<\/strong><\/h2>\n\n\n\n<p>Timed intercourse is another age-old method where women have unprotected sex in days when they are not ovulating. Thus, pregnancy is theoretically avoided. However, the truth is that it&#8217;s tough to predict when ovulation will occur. Even apps that predict ovulation aren&#8217;t fool-proof. Thus, there is no &#8220;safe&#8221; period of the month to have unprotected sex if you&#8217;re attempting to avoid pregnancy. Also, unprotected intercourse during a woman&#8217;s menstruation could put her at <a href=\"https:\/\/askpinkypromise.com\/faq\/pregnancy\/what-are-the-most-common-pregnancy-complications\/\" target=\"_blank\" rel=\"noreferrer noopener\">risk of pregnancy<\/a> if her menstrual cycle is shorter (for example, 23 days).<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>3. Long-acting reversible contraceptives<\/strong>:<\/h3>\n\n\n\n<p>Long-acting reversible contraceptive options, such as the contraceptive injection, contraceptive implant, intrauterine system, and intrauterine device (IUD), are the most effective ways to prevent pregnancy.<\/p>\n\n\n\n<p>Intrauterine devices (IUDs), as the name suggests, are worn inside the uterus. They require a doctor’s appointment to be inserted in a relatively quick process. Once inserted, they can be kept inside for as long as 10 years! The most popular is the Copper-T IUD. Another is the IUS (Intrauterine system), which releases a small dose of hormones inside the uterus to the ovaries to prevent pregnancy. The contraceptive implant also works in a similar way to prevent pregnancy. All of these have an accuracy rate of 99% at preventing pregnancy.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>4. Hormonal contraceptive pills, patches and rings<\/strong>:<\/h4>\n\n\n\n<p>Just like Estrogen and Progesterone are two hormones that help you get your periods and get pregnant, they can be used in very quantities in order to prevent pregnancy also. Birth control pills contain very very small concentrations of either estrogen and progestin (the synthetic version of progesterone) or progestin only and work to prevent ovulation. So if you don&#8217;t ovulate, you don&#8217;t get pregnant either! Birth control pills have to be taken every single day at a certain time for 21 days, or without a break. Hormonal patches and the vaginal ring also help prevent pregnancy in a similar manner. The Patches are worn for 21 days. Before moving to a new patch, they are eliminated for seven days. Vaginal rings are also worn for 21 days before being removed and replaced for seven days.<\/p>\n\n\n\n<p>Here are some precautions to follow if you are using the hormonal methods:<\/p>\n\n\n\n<ul>\n<li>Every day, you should take the pill at the same time. Your hormonal balance can be disrupted if you take the pill too early or too late. This may reduce the pill&#8217;s effectiveness.<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>Do not skip doses. Your birth control becomes less effective if you miss a day.<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>You should take a missed pill as soon as possible. In case you forget to take the pill one day, take it as soon as you remember. If you skip two days, take both pills simultaneously or at separate times during the day. If you miss a placebo day, discard the non hormonal pill and return to your regular regimen.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>On-time, replace the ring or skin patch. You are not protected against pregnancy if you neglect to change your ring or skin patch.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\"><strong>5. Using condoms correctly to prevent pregnancy<\/strong>:<\/h5>\n\n\n\n<p>As mentioned above, condoms are the only mode of birth control which prevent against both pregnancy and sexually transmitted infections. Condoms come in two types &#8211; ones which can be worn on the penis (male condoms) and ones which can be inserted into the vagina (female condoms).<sup>2<\/sup><\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Takeaway<\/strong><\/p>\n\n\n\n<p>There are numerous contraceptive options available to help prevent conception, ranging from barrier methods to hormonal pills, patches, and IUDs.<\/p>\n\n\n\n<p>Different methods may work better for different people. You may attempt a few different contraceptive procedures before finding one that works for you.<\/p>\n\n\n\n<p>The efficiency of various contraceptive methods varies. People who are sexually active should discuss their options with their doctor so that they can select the method that is best for them.<\/p>\n\n\n\n<p>Finally, keep in mind that only male and female condoms are effective at preventing STIs.<sup>3<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"> <img decoding=\"async\" loading=\"lazy\" width=\"1079\" height=\"711\" class=\"wp-image-2043\" style=\"width: 470px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/07\/How-to-prevent-pregnancy.png\" alt=\"how to prevent pregnancy- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/07\/How-to-prevent-pregnancy.png 1079w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/07\/How-to-prevent-pregnancy-300x198.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/07\/How-to-prevent-pregnancy-1024x675.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/07\/How-to-prevent-pregnancy-768x506.png 768w\" sizes=\"(max-width: 1079px) 100vw, 1079px\" \/><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[65],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/2042"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=2042"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=2042"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}