{"id":2095,"date":"2022-08-03T14:46:34","date_gmt":"2022-08-03T09:16:34","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=2095"},"modified":"2022-08-26T15:27:30","modified_gmt":"2022-08-26T09:57:30","slug":"how-to-take-abortion-pills","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/abortion\/how-to-take-abortion-pills\/","title":{"rendered":"How to take abortion pills?"},"content":{"rendered":"\n<p>Medical abortion requires you to take abortion pills either orally or through the vagina. No anesthesia or surgery is required, unlike a surgical abortion. It works by combining two pills that, when taken together, induce an abortion.<sup>1<\/sup>&nbsp;<\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>Abortion pills &#8211; How it works:<\/strong><\/h2>\n\n\n\n<p>Firstly, these pills are prescription medications which means you have to go to a doctor in order to obtain them. Secondly, due to their effects, it is generally recommended that no one should ever take these medicines without them being prescribed as they can lead to very serious consequences if taken incorrectly.&nbsp;<\/p>\n\n\n\n<p>A gynaecologist will first evaluate the progression of one’s pregnancy by taking tests and scans necessary. If one is pregnant but does not want to proceed with the pregnancy, the doctor will evaluate that person’s options given the extent to which the pregnancy has progressed as well as the patient’s medical history, among other things. Then a doctor may recommend a medical abortion if the pregnancy is early enough and there are no risks to the procedure.&nbsp;<\/p>\n\n\n\n<p>During a medical abortion, two pills are taken with a gap in order to induce a miscarriage and terminate the pregnancy. The first pill is called Mifepristone. Progesterone is a hormone that is required for normal pregnancy growth. Mifepristone inhibits the growth of pregnancy by blocking the body&#8217;s natural ability to produce progesterone.<\/p>\n\n\n\n<p>Then, either straight away or up to 48 hours later (based on the doctor’s guidance), you take the second pill, Misoprostol. To empty your uterus, this pill induces cramping and bleeding. It feels like you&#8217;re having a particularly heavy bleeding, crampy period, and the procedure is a lot like an early miscarriage. Call your nurse or doctor if you don&#8217;t have any bleeding within 24 hours of taking the second set of abortion pills.<strong> <\/strong>Your doctor or nurse will provide you with the following instructions regarding abortion pills &#8211; time to take, where to take them, and how to take them. Antibiotics may also be prescribed to prevent infection.<sup>2<\/sup><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>Side Effects of Abortion Pills:<\/strong><\/h3>\n\n\n\n<p>Shortly after taking the second pill, the most severe <a href=\"https:\/\/askpinkypromise.com\/faq\/abortion\/what-are-the-side-effects-of-abortion-pills\/\" target=\"_blank\" rel=\"noreferrer noopener\">side effects of abortion pills<\/a> begin. <\/p>\n\n\n\n<p>When you have taken both the pills, you can expect the following:<\/p>\n\n\n\n<p>&#8211; Bleeding and cramping begin one to four hours after the second pill is taken.<\/p>\n\n\n\n<p>&#8211; For the following several hours after taking the pill, there will be heavy bleeding with blood clots.<\/p>\n\n\n\n<p>&#8211; Several hours of severe pain and cramping.&nbsp;<\/p>\n\n\n\n<p>&#8211; After taking the second pill, you may experience a mild fever or chills that continue for about a day. Others claim to feel exhausted, nauseous, and dizzy, and some even experience stomach pain after taking abortion pills.<sup>3<\/sup>&nbsp;<\/p>\n\n\n\n<h4 class=\"has-medium-font-size wp-block-heading\"><strong>Post Abortion Care:<\/strong><\/h4>\n\n\n\n<p>Your doctor will provide you with specific aftercare instructions post your abortion. Once the abortion is complete, doctors may advise you to do the following:<\/p>\n\n\n\n<ul><li>Keep yourself hydrated, especially if you&#8217;re vomiting or have diarrhea<\/li><li>Heating pads might help to relieve cramps<\/li><li>As a result of the dramatic hormonal shift, some women may experience emotional changes. Therefore, having a support system at such times is helpful<\/li><li>Plan on remaining indoors for a day or two if possible to help you rest and heal in the comfort of your home<\/li><li>To relieve cramps and pain, take a pain reliever such as ibuprofen<\/li><li>Massage your abdomen when you experience cramps<\/li><li>To reduce breast soreness, wear a bra that fits tightly <sup>4<\/sup><\/li><\/ul>\n\n\n\n<p>Once you get a medical abortion, most doctors may advise you to ensure that you are using protection while having sex because you are extremely fertile after the procedure and the risk of another pregnancy is quite high.<sup>5<\/sup>&nbsp;<\/p>\n\n\n\n<p>The choice of medical abortion is an extremely personal one. Your healthcare professional may walk you through the procedure and ensure that you understand what to expect before and after it. Your doctor will be there to make sure you&#8217;re comfortable and getting the treatment you require, so don’t worry! <sup>6<\/sup><\/p>\n\n\n\n<p>If you want to ask any questions related to sexual health care and pregnancy, you can always do that on the Pinky Promise App. Our app has chatrooms where you can connect with thousands of people and ask your doubts freely, without facing any judgemental issues. You can also have a symptom check on our gynaecologist-verified chatbot which answers instantly and all this can be done for FREE! Download the Pinky Promise App now!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"> <img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"714\" class=\"wp-image-2096\" style=\"width: 550px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/How-to-take-abortion-pills.png\" alt=\"take abortion pills- pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/How-to-take-abortion-pills.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/How-to-take-abortion-pills-300x198.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/How-to-take-abortion-pills-1024x677.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/How-to-take-abortion-pills-768x508.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[66],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/2095"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=2095"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=2095"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}