{"id":2097,"date":"2022-08-03T14:51:55","date_gmt":"2022-08-03T09:21:55","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=2097"},"modified":"2023-05-17T18:29:25","modified_gmt":"2023-05-17T12:59:25","slug":"what-are-the-side-effects-of-abortion-pills","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/abortion\/what-are-the-side-effects-of-abortion-pills\/","title":{"rendered":"What are the side effects of abortion pills?"},"content":{"rendered":"\n<p class=\"has-medium-font-size\"><strong>Overview:<\/strong><\/p>\n\n\n\n<ol>\n<li>Medical abortion is done with two pills &#8211; Mifepristone and Misoprostol.<\/li>\n<\/ol>\n\n\n\n<ol start=\"2\">\n<li>Vaginal bleeding and cramps are common, but if you soak through more than two pads in an hour for 2 hours, call your doctor and go to a hospital.<\/li>\n<\/ol>\n\n\n\n<ol start=\"3\">\n<li>It is crucial to go through a medical abortion supervised by a qualified doctor in order to ensure your safety.<br><\/li>\n\n\n\n<li>An ultrasound is performed two weeks after the abortion to ensure complete evacuation of the products of conception i.e. you are no longer pregnant.&nbsp;<\/li>\n<\/ol>\n\n\n\n<p><\/p>\n\n\n\n<p>When you have a medical abortion, it is common to experience some side effects of abortion pills. Read this article to thoroughly understand the side effects and the importance of keeping your gynaecologist updated throughout the process.<\/p>\n\n\n\n<p>There are two main types of abortion &#8211; medical abortion and <a href=\"https:\/\/askpinkypromise.com\/faq\/abortion\/how-to-get-rid-of-pregnancy-without-using-abortion-pills\/\" target=\"_blank\" rel=\"noreferrer noopener\">surgical abortion<\/a>. Medical abortion is carried out with what is commonly called &#8220;abortion pills&#8221;. Surgical abortion, on the other hand, is a process of terminating the pregnancy under anesthesia by a minor procedure called Suction and Evacuation. Additionally, medical abortion should not be confused with the morning-after pill (like iPill and Unwanted72) that is used to <a href=\"https:\/\/askpinkypromise.com\/faq\/pregnancy\/how-to-prevent-pregnancy\/\" target=\"_blank\" rel=\"noreferrer noopener\">prevent a pregnancy<\/a> but does not have any effect if one is already pregnant. <\/p>\n\n\n\n<p>During a medical abortion, two pills are taken in combination. These pills are Mifepristone and Misoprostol.<sup>1<\/sup> In India, both these pills are usually sold together as a part of a kit. Some common brands are Unwanted Kit, Mifegest Kit and so on. These are not legally available over the counter and must be obtained from a certified Gynaecologist after proper consultation only. Mifepristone works by stopping the action of progesterone. Without progesterone, the uterine lining will weaken, and the embryo will no longer remain attached. Misoprostol, on the other hand, causes the uterus to contract, bleed, and remove the embryo.<\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>Abortion pills&#8217; side effects:<\/strong><\/h2>\n\n\n\n<p>The common side effects of abortion pills are:&nbsp;<\/p>\n\n\n\n<ul>\n<li>Nausea, vomiting, diarrhea, weakness, or dizziness. If these side effects persist longer than 24 hours after taking the second medicine (misoprostol), seek medical help right away because they could indicate a severe medical problem.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li>Vaginal bleeding and cramps after <a href=\"https:\/\/askpinkypromise.com\/faq\/abortion\/how-to-take-abortion-pills\/\" target=\"_blank\" rel=\"noreferrer noopener\">taking abortion pills<\/a><strong> <\/strong>are common during the procedure. Be prepared to experience these symptoms after taking mifepristone and misoprostol. In the 24 hours following the second medicine (misoprostol), nausea and cramps may become more severe. To help with these symptoms, your doctor may prescribe another medicine. You must inform your doctor immediately if any of these side effects persist. If you find yourself soaking more than two sanitary napkins in one hour for two hours, please inform your doctor right away and make sure you go to a hospital.&nbsp;<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li>If you get a fever of 100.4 degrees F (38 degrees C) or higher, or if you faint, have a fast heartbeat, or experience stomach pain after taking an abortion pill, seek medical help immediately.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li>It is extremely rare for these medications to cause a life-threatening severe reaction. However, if you detect any symptoms of a major allergic reaction, such as a rash, itching\/swelling (particularly of the face\/tongue\/throat), extreme dizziness, or problems breathing, seek medical help immediately.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>This isn&#8217;t a complete list of potential side effects. If you are going through a medical abortion and are not experiencing the above effects but feel uncomfortable in any manner, please do not ignore it and inform your doctor immediately.<sup>2<\/sup><\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>Some benefits of abortion pills are:<\/strong><\/h2>\n\n\n\n<ul>\n<li>It can feel like a more natural method.<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>You can obtain these as soon as you become certain that you are pregnant and do not wish to keep the pregnancy.<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>Anesthesia or surgery and hospital admission is not required.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>Some disadvantages of abortion pills are:<\/strong><\/h2>\n\n\n\n<ul>\n<li>For a few days, there may be heavy and painful bleeding.<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>After nine to eleven weeks of pregnancy, this procedure cannot be performed (this will be determined by the doctor).<\/li>\n<\/ul>\n\n\n\n<ul>\n<li>The procedure takes a longer duration of time.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"wp-block-heading has-medium-font-size\"><strong>The risks of abortion pills are:<\/strong><\/h2>\n\n\n\n<p>Make sure you are willing to take all the doses prescribed to you before beginning the abortion medication. There are serious health risks if you miss a dose or do not follow the instructions.<\/p>\n\n\n\n<p>The risks of a medical abortion are:<\/p>\n\n\n\n<ul>\n<li>Incomplete abortion<\/li>\n\n\n\n<li>Heavy vaginal bleeding that does not stop<\/li>\n\n\n\n<li>Infection<\/li>\n\n\n\n<li>Fever<\/li>\n\n\n\n<li>Diarrhea and digestive pain<\/li>\n\n\n\n<li>Allergic reactions to the medications <sup>3<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading has-medium-font-size\"><strong>Are there any long-term side effects of abortion pills?<\/strong><\/h3>\n\n\n\n<p>Abortion pills are actually very safe and effective. It&#8217;s a common method of abortion, and millions of people have been using it safely. Hence, there are no common long-term side effects of abortion procedures.<\/p>\n\n\n\n<p>Medical abortion does not usually affect future pregnancies or your overall health unless there is a rare or serious complication that is left untreated. It does not affect fertility and does not increase your risk of having breast cancer. There are no side effects of abortion pills for future pregnancy, such as birth abnormalities, premature birth or low birth weight, ectopic pregnancy, miscarriage or infant death.<\/p>\n\n\n\n<p>Serious, long-term emotional problems following an abortion are as uncommon as they are after giving birth. They are more likely to occur in women who have to terminate (end) their pregnancy for health reasons or women who do not have support in their decision to have an abortion or those who have a history of mental health problems. Most women feel relieved after having an abortion for an unwanted pregnancy.<sup>4<\/sup><\/p>\n\n\n\n<p>Having said that, it is much better to use contraception appropriately and avoid pregnancy.<\/p>\n\n\n\n<h3 class=\"wp-block-heading has-medium-font-size\"><strong>How long do the side effects of abortion last?<\/strong><\/h3>\n\n\n\n<p>The after-abortion symptoms differ from person to person. On the day you take your second pill, try to rest and be in a comfortable place. You could feel exhausted for one or two days after taking the pill, but you will feel normal soon.<\/p>\n\n\n\n<p>If you feel well enough, you can return to work and most other normal activities the next day. But for a few days, you should avoid doing excessive physical activity or strenuous exercise. As time passes, you will start to feel better, but if you still feel unwell or too weak, contact your doctor immediately.<\/p>\n\n\n\n<p>As the hours and days pass after your abortion is completed, the cramping and vaginal bleeding should decrease. Additionally, you can experience breast tenderness, and they may leak a milky discharge. This should stop in a few days. You&#8217;ll feel more at ease if you wear a snug-fitting bra.<\/p>\n\n\n\n<p>Chills, fevers or nausea that you experience should go away pretty quickly. If you have nausea, vomiting, diarrhea or a fever for more than 24 hours after taking misoprostol (the second set of pills), call your doctor immediately, as it could be a sign of an infection.<sup>5<\/sup><\/p>\n\n\n\n<h4 class=\"wp-block-heading has-medium-font-size\"><strong>Is constipation a side effect of the abortion pill?<\/strong><\/h4>\n\n\n\n<p>Constipation is a common side effect of abortion. After an abortion, many women experience constipation, nausea or diarrhea. The hormonal changes that one has to go through in the process of abortion are partly responsible for constipation, diarrhea and nausea. The pregnancy hormones will stay in your system for some time, even after an abortion. As pregnancy hormones slow down the metabolism, it also affects bowel movements.&nbsp;<\/p>\n\n\n\n<p>Your doctor may prescribe iron supplements to replace your depleted iron levels after the loss of blood caused due to an abortion. Iron supplements are also known to cause constipation. In order to manage constipation, it is generally advised to drink more fluids and eat foods that are rich in fibre.<sup>6<\/sup> Throughout the medical abortion procedure, you should cooperate closely with your doctor. Discuss any of your concerns and ensure that you understand the procedure and what to expect.<sup>7<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"> <img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"706\" class=\"wp-image-2098\" style=\"width: 520px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/What-are-the-side-effects-of-abortion-pills.png\" alt=\"side effects of abortion pills- ask pinky promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/What-are-the-side-effects-of-abortion-pills.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/What-are-the-side-effects-of-abortion-pills-300x196.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/What-are-the-side-effects-of-abortion-pills-1024x669.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/What-are-the-side-effects-of-abortion-pills-768x502.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[66],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/2097"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=2097"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=2097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}