{"id":2137,"date":"2022-08-16T19:13:24","date_gmt":"2022-08-16T13:43:24","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=2137"},"modified":"2023-05-13T16:57:36","modified_gmt":"2023-05-13T11:27:36","slug":"when-do-periods-start","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/periods\/when-do-periods-start\/","title":{"rendered":"When do periods start?"},"content":{"rendered":"\n<p>Menarche, or the first time when periods start in a girl, is a biological process that occurs as a result of hitting puberty. It&#8217;s a sign that your body is ready to begin reproduction. Puberty is the period of your life when your body goes through a lot of changes which typically start between the ages of 12 and 15 years. For example, on the exterior, you&#8217;ll notice hair starting to grow under your arms and around your pubic area, as well as the development of your breasts. On the inside, you begin to have periods as a result of the release of female hormones estrogen and progesterone.<sup>1<\/sup><\/p>\n\n\n\n<p>For most girls, periods start when she is about 12 years old, though it varies from person to person. Some girls may begin as early as 8 years while others may start as late as 15 years depending on family history, race, food, environment, and weight. Period start age is usually any number between 10 and 15.<sup>2<\/sup><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What causes periods to occur?<\/strong><\/h2>\n\n\n\n<p>Changes in hormone levels is the main cause behind the start of the period. The hormone estrogen rises throughout the first half of the menstrual cycle, thickening the uterine lining. If pregnancy happens, this lining will nurture a fertilised egg (embryo). An egg in one of the ovaries begins to mature as the lining thickens. The egg is released from the ovary (ovulation) on day 14 of an average 28-day cycle. The egg moves to the uterus through one of the fallopian tubes. Pregnancy is confirmed if an egg is fertilised by a sperm and attaches to the uterine wall. If the egg is not fertilised, it falls away, hormone levels decline, and the thicker uterine lining is shed through the vagina. This marks the beginning of a period.<sup>3<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What will your periods be like?<\/strong><\/h2>\n\n\n\n<p>Every woman&#8217;s period is unique. Periods can differ in length, frequency, and intensity. Some women experience extremely mild periods, while others experience quite heavy periods. Some might even experience irregular periods<strong> <\/strong>due to reasons like PCOS, early pregnancy, use of hormonal contraceptive pills, excessive exercise, stress, or because of excess weight loss or weight gain.&nbsp;<\/p>\n\n\n\n<p>Some people get a light first period with only a modest amount of blood. It could start out slowly, with spots or brown discharge before turning red.<\/p>\n\n\n\n<p>Periods start suddenly for some, with bright red blood appearing right away. This is normal in either circumstance. The colour of period blood can range from brownish to dark reddish. Some people may also pass small blood clots.<sup>4<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>How to prepare for periods?<\/strong><\/h2>\n\n\n\n<p>Some menstrual products that you should keep handy:&nbsp;<\/p>\n\n\n\n<ul>\n<li><strong>Sanitary pads &#8211;<\/strong> Sanitary pads are padded strips that come in a variety of sizes, with a sticky side that you stick to your underwear to keep them in place. The pad has an absorbent substance on one side that absorbs away the blood.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Menstrual cups &#8211;<\/strong> Menstrual cups are a feminine hygiene product that can be used instead of tampons and pads. The cup is constructed of silicone and is inserted into your vaginal canal.&nbsp; Instead of absorbing blood, menstrual cups collect it. Unlike other menstrual products, which must be thrown away after each use, menstrual cups can be washed and reused.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Tampons &#8211;<\/strong> Tampons are little cotton wool tubes that you place into your vaginal canal to absorb blood before it exits your body. Tampons are supplied with instructions about how to use them. You should not be able to feel the tampon inside you if it is properly inserted. It might not be in properly if you can feel it or if it hurts.<sup>5<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>How to prepare your child for their first period?<\/strong><\/h3>\n\n\n\n<p>Many parents may feel embarrassed to talk to their children about periods and things related to it. But, what you have to remember is that periods are a natural process and part of the overall health and development of the body. Hence, talking about it to your child will only make them feel more confident and help them throughout the process.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>Some tips that may help you educate your child about their first period are:<\/strong><\/h3>\n\n\n\n<ul>\n<li>honestly and openly answer any questions your child may have regarding periods<\/li>\n\n\n\n<li>highlight the fact that menstruation is normal and natural<\/li>\n\n\n\n<li>use simple, concrete terms to describe body parts and functions<\/li>\n\n\n\n<li>ask your child about any concerns they may have about periods<\/li>\n\n\n\n<li>use suitable moments to start the conversation with your child, such as when you&#8217;re buying period products&nbsp;<\/li>\n\n\n\n<li>describe the benefits and drawbacks of various menstruation products<\/li>\n\n\n\n<li>ask if your child has any questions regarding menstruation products or suggestions about which type they&#8217;d prefer to use <sup>6<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h4 class=\"has-medium-font-size wp-block-heading\"><strong>These are the times when you should consider visiting your doctor:&nbsp;<\/strong><\/h4>\n\n\n\n<p>Although it&#8217;s usual for periods to be irregular at first, it&#8217;s advisable to contact a doctor if they don&#8217;t get regular over time or create symptoms that interfere with everyday life. If you or a young female in your care has had the following experiences, you should consult a doctor.<\/p>\n\n\n\n<ul>\n<li>a strong flow that necessitates changing pads or tampons every 1–2 hours<\/li>\n\n\n\n<li>significant discomfort or mood swings that prohibit you from doing your daily tasks<\/li>\n\n\n\n<li>there were no periods for more than three months from the first period<\/li>\n\n\n\n<li>periods that last longer than 7 days<\/li>\n\n\n\n<li>when by the age of 15, there has been no period <sup>7<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>If you have any questions or doubts related to women&#8217;s health, you can use our gynaecologist-approved chatbot or chat freely on our anonymous chatrooms. To do so, download the Pinky Promise App now!<\/p>\n\n\n\n<p> <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p class=\"has-text-align-center\"><img decoding=\"async\" loading=\"lazy\" width=\"1080\" height=\"714\" class=\"wp-image-2138\" style=\"width: 450px;\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/When-do-periods-start.png\" alt=\"When do periods start?- Ask Pinky Promise\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/When-do-periods-start.png 1080w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/When-do-periods-start-300x198.png 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/When-do-periods-start-1024x677.png 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2022\/08\/When-do-periods-start-768x508.png 768w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[15],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/2137"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=2137"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=2137"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}