{"id":3911,"date":"2023-04-17T14:32:04","date_gmt":"2023-04-17T09:02:04","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=3911"},"modified":"2023-04-21T17:02:01","modified_gmt":"2023-04-21T11:32:01","slug":"breast-cancer-causes-symptoms-treatments","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/breast-cancer\/breast-cancer-causes-symptoms-treatments\/","title":{"rendered":"Breast Cancer: Causes, Symptoms and Treatment"},"content":{"rendered":"\n<p>Breast cancer originates in the breast tissue and occurs when breast cells mutate (change) and grow uncontrollably, resulting in a mass of tissue (tumour). Breast cancer, like other cancers, can enter and grow in the tissue surrounding your breast. There are no definite causes of breast cancer. It can also spread to other parts of your body and cause new tumours to grow, and when this occurs, it is known as metastasis.<sup>1<\/sup><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What are the warning signs of breast cancer?<\/strong><\/h2>\n\n\n\n<p>There are no noticeable early symptoms of breast cancer. The tumour may be too small to be felt, but an abnormality can still be seen on a mammogram. If you can feel a tumour, the first sign is usually the appearance of a new lump in the breast that was not previously there. However, not all lumps are cancerous.<\/p>\n\n\n\n<p>Each type of breast cancer can produce a wide range of symptoms. Many of these symptoms are similar, but some are distinct. Some of the &nbsp;signs and symptoms of breast cancer are :<\/p>\n\n\n\n<ul>\n<li>Breast pain<\/li>\n\n\n\n<li>Swelling in all or one part of the breast<\/li>\n\n\n\n<li>A lump or swelling under the arm<\/li>\n\n\n\n<li>A nipple discharge other than breast milk is seen<\/li>\n\n\n\n<li>Bloody discharge from the nipple<\/li>\n\n\n\n<li>A lump is present in the breast or a thickening which feels different from the surrounding tissue<\/li>\n\n\n\n<li>You can see a change in the size, shape or appearance of the breast&nbsp;<\/li>\n\n\n\n<li>A newly inverted nipple<\/li>\n\n\n\n<li>Peeling, scaling, crusting or flaking of the pigmented area of skin around the nipple (areola) or breast skin<\/li>\n\n\n\n<li>Redness or pitting of the skin around your breast (like the skin of an orange) <sup>2<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What can be the <\/strong><strong>causes of breast cancer in females<\/strong><strong>?<\/strong><\/h2>\n\n\n\n<p>The causes of breast cancer are not understood completely. So, it may not be possible to pinpoint the major cause of breast cancer that almost everyone ignores. According to doctors, breast cancer occurs when some breast cells grow abnormally. These cells divide more rapidly than healthy cells and continue to aggregate together, to form a lump or mass. These cells in your breast may spread (metastasize) to your lymph nodes or other parts of your body.<\/p>\n\n\n\n<p>Breast cancer generally occurs due to cells in the milk-producing ducts (invasive ductal carcinoma). It can also begin in the glandular tissue known as lobules (invasive lobular carcinoma) or other cells or tissues within the breast.<\/p>\n\n\n\n<p>Researchers have found that hormonal, lifestyle and environmental factors may increase your chances of developing breast cancer. So, there is not any specific or real cause of breast cancer. However, it is unclear why some people with no risk factors develop cancer, and others with risk factors never do. A complex interaction between environmental causes along with genetic makeup likely leads to breast cancer.<sup>3<\/sup><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>Environmental causes of breast cancer:<\/strong><\/h2>\n\n\n\n<p>Environmental factors and toxic chemicals are known to raise the risk of breast cancer, and exposure to ionising radiation is one such factor. Chemicals in the environment with estrogen-like properties can increase the risk of breast cancer. Certain plastics, cosmetics and personal care products, pesticides, and PCBs (polychlorinated biphenyls) appear to have such properties. In theory, these could influence the risk of breast cancer.<\/p>\n\n\n\n<p>Research does not establish a clear link between breast cancer risk and exposure to these substances, although such effects in humans are more difficult to study.<sup> 4 5<\/sup><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>Can breast cancer be cured?<\/strong><\/h2>\n\n\n\n<p>Breast cancer treatment options are determined by your doctor based on the<a href=\"https:\/\/askpinkypromise.com\/faq\/breast-cancer\/types-of-breast-cancer\/\" target=\"_blank\" rel=\"noreferrer noopener\"> types of breast cancer<\/a>, its stage and grade, size, and whether the cancer cells are hormone sensitive. Your doctor will also consider your overall health along with your personal preferences.<\/p>\n\n\n\n<p>Most women undergo breast cancer surgery, and many need additional treatment after surgery, such as chemotherapy, hormone therapy, or radiation. In some cases, chemotherapy may be used before surgery.<\/p>\n\n\n\n<p>There are several treatment options for breast cancer, and you may feel overwhelmed as you make complex treatment decisions. You should consult a doctor and speak with other women who have made similar decisions.<sup> 6<\/sup><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>Breast cancer stages and treatment<\/strong><strong>:<\/strong><\/h2>\n\n\n\n<p>Can breast cancer go away naturally? No, once your doctor has diagnosed breast cancer, they will work to assess the extent (stage) of cancer. The stage of your cancer can determine your prognosis and treatment options.&nbsp;<\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>Breast cancer treatment by stage:<\/strong><\/h3>\n\n\n\n<ul>\n<li><strong>Stage 0 (DCIS) &#8211; <\/strong>It is a noninvasive breast cancer also called ductal carcinoma in situ (DCIS). It occurs when precancerous or cancerous cells are confined to the milk ducts. Breast cancer in stage 0 can become invasive and spread beyond the ducts. Early detection and treatment can prevent the development of invasive breast cancer. Early treatment may include surgeries such as a lumpectomy or mastectomy, followed by radiation.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage 1 &#8211; <\/strong>&nbsp;Here, cancer cells have spread to the nearby breast tissue. It is an invasive breast cancer in its early stages. Surgery with one or more additional therapies, such as radiation or hormone therapy, may be recommended.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage 2 &#8211; <\/strong>At this stage, tumours can measure anywhere between 2 to 5 cm across and may or may not affect the nearby lymph nodes. You&#8217;ll most likely require a combination of surgery, chemotherapy, and treatments like targeted therapy, radiation, and hormone therapy.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage 3 &#8211; <\/strong>Here, cancer has spread beyond the tumour (its point of origin). It may have invaded neighbouring tissue and lymph nodes, but it did not spread to distant organs. Treatment for stage 3 generally involves the combination of treatments like &#8211; Systemic therapy, Surgery and Radiation therapy.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage 4 &#8211; <\/strong>Cancer has spread to areas away from your breast, like your bones, liver, lungs or brain. Treatment for stage 4 primarily includes systemic therapy, although surgery and radiation may be options in certain situations. Systemic therapy may contain &#8211; Chemotherapy, Hormonal therapy (for hormone receptor-positive cancers) and Targeted therapy (for HER2-positive cancers) <sup>7<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>Triple-negative breast cancer treatment <\/strong><strong>(TNBC):&nbsp;<\/strong><\/h3>\n\n\n\n<p>If you have been diagnosed with breast cancer, one of the first things your doctor will do is see if the cancer cells are hormone receptive as it can direct your treatment options. Hormones can stimulate the growth of cancer cells if your cells contain hormone receptors. These receptors are not found in all breast cancer cells, and not all tumours overexpress the HER2 gene.<\/p>\n\n\n\n<p>Triple-negative breast cancer (TNBC) occurs when your cancer is not susceptible to these hormones and does not have an increased quantity of HER2.<\/p>\n\n\n\n<p>Hormone therapy stops hormones from causing cancer growth. Because TNBC cells lack estrogen and progesterone, these cells do not respond well to hormone therapy or medications that block HER2 receptors.<\/p>\n\n\n\n<p>Instead of hormone therapy, TNBC treatment often involves:<\/p>\n\n\n\n<ul>\n<li>Chemotherapy<\/li>\n\n\n\n<li>Radiation therapy<\/li>\n\n\n\n<li>Surgery<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>TNBC can often be treated successfully if it is diagnosed early. However, in general, survival rates are lesser with TNBC compared to other forms of breast cancer.<sup>8<\/sup><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>How to avoid breast cancer?<\/strong><\/h3>\n\n\n\n<p>It is now difficult to determine if you can prevent breast cancer because the causes of the condition are not fully understood. So, it is important to notice the signs and symptoms of breast cancer and always check your breast condition. If you are at a higher risk of developing breast cancer, there are certain treatments available to reduce your risk.<\/p>\n\n\n\n<p>Several studies have been performed to understand the link between breast cancer and diet. Although there are no definite conclusions, there are some benefits for women who:<\/p>\n\n\n\n<ul>\n<li>Maintain a healthy weight<\/li>\n\n\n\n<li>Exercise regularly<\/li>\n\n\n\n<li>Have a low intake of saturated fat<\/li>\n\n\n\n<li>Avoid drinking alcohol<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>Regular exercise and a healthy lifestyle can help improve the outlook of breast cancer patients. If you&#8217;ve been through menopause, it is important to achieve and maintain a healthy weight. This is because being overweight or obese increases the production of estrogen, which increases the risk of breast cancer.<sup>9<\/sup><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>Who is at high risk for breast cancer?<\/strong><\/h3>\n\n\n\n<p>According to research, various risk factors may increase your risk of breast cancer. These include:<\/p>\n\n\n\n<ul>\n<li>People above 55 or older increase the risk of developing breast cancer.<\/li>\n\n\n\n<li>Women have a higher chance of getting breast cancer than men.<\/li>\n\n\n\n<li>If you have a family history of breast cancer, you are more likely to develop the disease at some point.&nbsp;<\/li>\n\n\n\n<li>Drinking alcohol or smoking can increase your risk of developing certain cancers.<\/li>\n\n\n\n<li>Being obese can increase your risk of breast cancer and its recurrence.<\/li>\n\n\n\n<li>Early menstruation or late menopause can increase the risk of breast cancer.<\/li>\n\n\n\n<li>People undergoing radiation therapy or hormone replacement therapy are at a higher risk of getting breast cancer.<\/li>\n\n\n\n<li>Having dense breast tissue makes it difficult to read mammograms, which increases the risk of breast cancer.<sup> 10 11<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>At what age is breast cancer usually seen?<\/strong><\/h3>\n\n\n\n<p>Although it can happen at any age, breast cancer is commonly found in adults above 50.<sup>12<\/sup><\/p>\n\n\n\n<h4 class=\"has-medium-font-size wp-block-heading\"><strong>What foods stop breast cancer growth?<\/strong><\/h4>\n\n\n\n<p>Remember that you can get breast cancer due to many factors. While improving your diet can help improve your overall health and lower your cancer risk, it is only one piece of the puzzle. However, evidence suggests that certain foods may reduce your risk of developing the disease.<\/p>\n\n\n\n<ul>\n<li>Green leafy vegetables<\/li>\n\n\n\n<li>Cruciferous vegetables like cauliflower, cabbage, broccoli etc.<\/li>\n\n\n\n<li>Citrus fruits<\/li>\n\n\n\n<li>Berries<\/li>\n\n\n\n<li>Peaches, apples, pears, grapes<\/li>\n\n\n\n<li>Fatty fish<\/li>\n\n\n\n<li>Allium vegetables like garlic, onions etc.<\/li>\n\n\n\n<li>Fatty fish<\/li>\n\n\n\n<li>Fermented foods<\/li>\n\n\n\n<li>Beans<\/li>\n\n\n\n<li>Herbs and spices<\/li>\n\n\n\n<li>Whole grains<\/li>\n\n\n\n<li>Walnuts<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h4 class=\"has-medium-font-size wp-block-heading\"><strong>What foods trigger breast cancer?<\/strong><\/h4>\n\n\n\n<p>While certain foods may protect you against breast cancer, others may increase your risk. So, it is best to avoid these foods and beverages to reduce the risk of breast cancer.<\/p>\n\n\n\n<ul>\n<li>Caffeine<\/li>\n\n\n\n<li>Alcohol<\/li>\n\n\n\n<li>Fast food and fried food<\/li>\n\n\n\n<li>Processed meat like bacon and sausages&nbsp;<\/li>\n\n\n\n<li>Added sugar<\/li>\n\n\n\n<li>Refined carbohydrates <sup>13<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>Want to know more? Come to the Pinky Promise app. Pinky Promise is a safe and judgement-free space build to help women all across the world and aims to solve their reproductive health issues at the click of their fingers. Get diagnosed easily, book tests, and take care of yourself without any complications! Also be a part of anonymous community support chatrooms where you can connect with thousands of women from all over the world and freely ask anything in a judgement-free zone!&nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/Breast-Cancer-Causes-Symptoms-and-Treatment-1024x571.webp\" alt=\"Breast Cancer-Causes, Symptoms and Treatment | Ask Pinky Promise\" class=\"wp-image-3913\" width=\"455\" height=\"254\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/Breast-Cancer-Causes-Symptoms-and-Treatment-1024x571.webp 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/Breast-Cancer-Causes-Symptoms-and-Treatment-300x167.webp 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/Breast-Cancer-Causes-Symptoms-and-Treatment-768x428.webp 768w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/Breast-Cancer-Causes-Symptoms-and-Treatment.webp 1080w\" sizes=\"(max-width: 455px) 100vw, 455px\" \/><\/figure><\/div>\n\n\n<p><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[75],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/3911"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=3911"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=3911"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}