{"id":3964,"date":"2023-04-20T16:31:41","date_gmt":"2023-04-20T11:01:41","guid":{"rendered":"https:\/\/askpinkypromise.com\/?post_type=faq&#038;p=3964"},"modified":"2023-04-29T18:46:04","modified_gmt":"2023-04-29T13:16:04","slug":"types-of-breast-cancer","status":"publish","type":"faq","link":"https:\/\/askpinkypromise.com\/faq\/breast-cancer\/types-of-breast-cancer\/","title":{"rendered":"What are the types of breast cancer?"},"content":{"rendered":"\n<p>Breast cancer is a type of cancer that can develop in the breast cells. It typically forms in the lobules or ducts. Lobules are milk-producing glands, while ducts are the pathways that bring milk from the glands to the nipple. There are many types of breast cancer. These cancers can also develop in the breast&#8217;s fatty tissue or fibrous connective tissue. The uncontrolled cancer cells frequently spread to neighbouring healthy breast tissue and travel to the lymph nodes under the arms. When cancer enters the lymph nodes, it has access to a pathway that can spread to other body parts.<sup>1<\/sup><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What are the different stages of breast cancer?<\/strong><\/h2>\n\n\n\n<p>Breast cancer stages are classified based on the size of the tumour and how far it has spread. Cancers that are large or have invaded surrounding tissues or organs are at a higher stage than cancers that are small or contained within the breast. The stages of breast cancer are:<\/p>\n\n\n\n<ul>\n<li><strong>Stage 0 &#8211;<\/strong> The disease is not invasive. It implies it hasn&#8217;t moved out of your breast ducts.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage I <\/strong>&nbsp;<strong>&#8211;<\/strong> At this stage, the cancer cells have spread to nearby breast tissue.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage II<\/strong> <strong>&#8211;<\/strong> Tumours at this stage can range from 2 to 5 cm in size and may or may not affect surrounding lymph nodes.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage III &#8211;<\/strong> At this stage, cancer has spread beyond its point of origin. Although it has invaded nearby tissue and lymph nodes, it has not spread to distant organs.&nbsp;<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Stage IV &#8211; <\/strong>Cancer has spread to other body parts away from your breast, including your bones, liver, lungs, and brain. Stage IV breast cancer is also known as metastatic breast cancer.<sup>2<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What are the types of breast cancer?<\/strong><\/h2>\n\n\n\n<p>There are many different types of breast cancer, divided into two main categories: invasive and non-invasive breast cancer.<\/p>\n\n\n\n<p>Non-invasive cancer (also known as breast cancer in situ) has not spread from the original tissue, whereas invasive breast cancer has spread from the breast ducts or glands to other parts of the breast.<\/p>\n\n\n\n<p>Such categories are used to describe the most common types of breast cancer, which are:<\/p>\n\n\n\n<ul>\n<li><strong>Ductal carcinoma in situ (DCIS) &#8211;<\/strong> DCIS&nbsp; is a non-invasive condition. The cancer cells in DCIS are contained in the ducts in your breast and have not spread to the surrounding breast tissue.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Lobular carcinoma in situ (LCIS) &#8211; <\/strong>LCIS is a cancer that grows in the milk-producing glands of your breast. Like DCIS, the cancer cells have not spread to the surrounding tissue.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Invasive ductal carcinoma (IDC) &#8211; <\/strong>IDC&nbsp; is the most common type of breast cancer which starts in the breast&#8217;s milk ducts and later spreads to nearby tissue. This cancer can spread to nearby organs and tissue once it has spread to the tissue outside your milk ducts.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Invasive lobular carcinoma (ILC) &#8211; <\/strong>ILC first develops in the lobules and spreads to nearby tissue.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>The less common types of breast cancer are the following:<\/p>\n\n\n\n<ul>\n<li><strong>Paget disease of the breast (the nipple) &#8211; <\/strong>This type of breast cancer begins in the ducts of the nipple, but as it grows, it affects the skin and areola of the nipple.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Phyllodes tumour &#8211; <\/strong>This is a rare type of breast cancer that grows in the breast&#8217;s connective tissue. The majority of these tumours are benign, but a few are cancerous.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Angiosarcoma &#8211; <\/strong>This type of cancer grows in the breast&#8217;s blood or lymph vessels.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Inflammatory breast cancer &#8211; <\/strong>&nbsp;It appears as a rash with an orange peel-like skin texture on the affected breast.<sup>3<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"has-medium-font-size wp-block-heading\"><strong>What is the most serious type of breast cancer?<\/strong><\/h2>\n\n\n\n<p>Triple-negative breast cancer (TNBC) is the most serious type of breast cancer. The term triple-negative breast cancer refers to cancer cells that lack estrogen and progesterone receptors and a high level of human epidermal growth factor receptor 2 (HER2); these markers are essential for prognosis and treatment. Because it is aggressive and rare, treatment options are limited. It also has a high recurrence rate.<\/p>\n\n\n\n<p>Triple-negative breast cancer is seen in people having a BRCA gene mutation, people under 50 and pregnancy-associated breast cancer are triple-negative. Treatment options include: surgery, radiation therapy and chemotherapy.<sup>4<\/sup><\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>What are<\/strong><strong> breast cancer lumps?<\/strong><\/h3>\n\n\n\n<p>It is the most common symptom when you have breast cancer. Yet, breast cancer can also appear as a thickened tissue or skin rather than a distinct lump. Certain types of breast cancer (such as inflammatory breast cancer) may not cause a breast lump. In females, the breast lumps are generally seen near the armpit. In males, they are found near the nipple.&nbsp;<\/p>\n\n\n\n<p>Breast cancer lumps have characteristics that distinguish them from noncancerous lumps. Remember that these are generalisations. Do not try to diagnose a lump on your own. Doctors, too, cannot always tell by touch alone.<\/p>\n\n\n\n<p>Here are several signs that a breast lump is cancerous:<\/p>\n\n\n\n<ul>\n<li>It can&#8217;t hurt<\/li>\n\n\n\n<li>It&#8217;s bumpy<\/li>\n\n\n\n<li>It&#8217;s either firm or hard<\/li>\n\n\n\n<li>It has irregular edges<\/li>\n\n\n\n<li>It is growing or changing<\/li>\n\n\n\n<li>You can&#8217;t move it with your fingers<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>Breast cancer lumps can sometimes present quite differently. They can be soft, movable, and painful. They might also appear anywhere on the chest or armpit. Make an appointment to see your doctor if you notice a suspicious lump which is like breast cancer lumps or spots in your breast or any other breast cancer symptoms. It&#8217;s unlikely that it&#8217;s breast cancer as there are numerous other possible causes of breast lumps.<sup>5<\/sup><\/p>\n\n\n\n<h3 class=\"has-medium-font-size wp-block-heading\"><strong>How to treat breast cancer?<\/strong><\/h3>\n\n\n\n<p>Your doctor will evaluate the size, stage, and grade of your cancer. The grade of your cancer determines how prone it is to grow and spread. Following that, you can talk about your treatment options.<\/p>\n\n\n\n<p>Surgery is the most often used method of treating breast cancer. Many people receive additional treatments, including &#8211;<\/p>\n\n\n\n<ul>\n<li><strong>Hormone therapy: <\/strong>If your breast cancer is sensitive to hormones, you can start hormonal therapy. Here, if we detect that it is a hormone receptor-positive cancer, they can use endocrine therapy to block the estrogen and progesterone receptors.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Radiation therapy: <\/strong>Here, a high-powered beam of radiation can be used to target and kill cancer cells. The majority of radiation treatments use external beam radiation.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<ul>\n<li><strong>Chemotherapy: <\/strong>This is where drug treatment is used to destroy cancer cells. Some people may receive chemotherapy on its own, but it is used frequently with other treatments, including surgery.<sup>6<\/sup><\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h4 class=\"has-medium-font-size wp-block-heading\"><strong>Takeaway&nbsp;<\/strong><\/h4>\n\n\n\n<p>The <a href=\"https:\/\/askpinkypromise.com\/faq\/breast-cancer\/breast-cancer-causes-symptoms-treatments\/\" target=\"_blank\" rel=\"noreferrer noopener\">causes of breast cancer<\/a> are unknown. Hence, early detection and treatment are essential. If detected early, early-stage breast cancer can often be treated and cured. The longer breast cancer is allowed to grow, the more difficult it can become. If you&#8217;ve already been diagnosed with breast cancer, remember that cancer treatments and outcomes are constantly improving. So stick to your treatment plan and don’t lose heart &#8211; you’re not alone in this! <sup>7<\/sup> There are a lot of women experiencing this or who have experienced this and came through strong! You can connect with thousands of women from all around the globe in a safe space, just like Pinky Promise and talk to them without the fear of being judged! Pinky Promise app has anonymous chatrooms where your privacy is respected and this is absolutely FREE! Download the Pinky Promise App now to connect with like-minded people and help each other fight the battle of life.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/What-are-the-types-of-breast-cancer-Canva-1024x678.webp\" alt=\"types of breast cancer- ask pinky promise\" class=\"wp-image-3965\" width=\"431\" height=\"286\" srcset=\"https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/What-are-the-types-of-breast-cancer-Canva-1024x678.webp 1024w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/What-are-the-types-of-breast-cancer-Canva-300x199.webp 300w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/What-are-the-types-of-breast-cancer-Canva-768x509.webp 768w, https:\/\/askpinkypromise.com\/wp-content\/uploads\/2023\/04\/What-are-the-types-of-breast-cancer-Canva.webp 1072w\" sizes=\"(max-width: 431px) 100vw, 431px\" \/><\/figure><\/div>\n\n\n<p><\/p>\n","protected":false},"featured_media":0,"parent":0,"template":"","meta":[],"topics":[75],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq\/3964"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/faq"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/faq"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=3964"}],"wp:term":[{"taxonomy":"topics","embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/topics?post=3964"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}