{"id":1712,"date":"2022-05-12T14:09:08","date_gmt":"2022-05-12T08:39:08","guid":{"rendered":"https:\/\/askpinkypromise.com\/?page_id=1712"},"modified":"2023-01-07T20:53:07","modified_gmt":"2023-01-07T15:23:07","slug":"terms-of-service","status":"publish","type":"page","link":"https:\/\/askpinkypromise.com\/terms-of-service\/","title":{"rendered":"Terms of Service"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"1712\" class=\"elementor elementor-1712\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-7fb94a4 elementor-section-height-min-height elementor-section-boxed elementor-section-height-default elementor-section-items-middle\" data-id=\"7fb94a4\" data-element_type=\"section\" data-settings=\"{&quot;background_background&quot;:&quot;gradient&quot;,&quot;shape_divider_bottom&quot;:&quot;curve&quot;,&quot;shape_divider_bottom_negative&quot;:&quot;yes&quot;}\">\n\t\t\t\t\t<div class=\"elementor-shape elementor-shape-bottom\" data-negative=\"true\">\n\t\t\t<svg xmlns=\"http:\/\/www.w3.org\/2000\/svg\" viewBox=\"0 0 1000 100\" preserveAspectRatio=\"none\">\n\t<path class=\"elementor-shape-fill\" d=\"M500,97C126.7,96.3,0.8,19.8,0,0v100l1000,0V1C1000,19.4,873.3,97.8,500,97z\"\/>\n<\/svg>\t\t<\/div>\n\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-b8b7620\" data-id=\"b8b7620\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-35f3ecc elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"35f3ecc\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-45bdb63\" data-id=\"45bdb63\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-124eccd elementor-widget elementor-widget-text-editor\" data-id=\"124eccd\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.10.2 - 29-01-2023 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#818a91;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#818a91;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<p><span style=\"font-weight: 400;\">Hello,<\/span><\/p><p><span style=\"font-weight: 400;\">Welcome to Pinky Promise Pvt. Ltd. Terms and Conditions. These terms of use (“Terms of Service”) govern the terms on which you (hereinafter referred to as “You” or “Your” or “User” or “Customer”) access, register on and use the ‘Pinky Promise’ Application, Services, or Products, operated by Pinky Promise Pvt. Ltd. (hereinafter referred to as “We” or “Our” or “Us” or “Company”).<\/span><\/p><p><span style=\"font-weight: 400;\">Please read these Terms of Service carefully before registering and every time before You use Our Application or access any material, information, Service or Product. If You do not agree with any of these Terms of Service, You must immediately cease accessing and using Our Website, Application, Services or Products. Your use of Our Products, Services, Application, or Website, shall signify Your acceptance of these Terms of Service and consequentially Your agreement to be legally bound by the same.<\/span><\/p><p><span style=\"font-weight: 400;\">You understand that every part of these Terms of Service, individually and as a whole, constitute a legally binding Contract, between you and Pinky Promise Pvt. Ltd. You understand that every clause\/sub-clause of these Terms of Service are severally as well as together, specifically enforceable. You undertake that You are competent to enter into this Contract and to agree to these Terms of Service, and You are entering into this Contract and agreeing to these Terms of Service with your own free will. By agreeing to the Terms of Service, you represent that you are legally authorized to accept and be bound by the terms of this Agreement.<\/span><\/p><p><span style=\"font-weight: 400;\">By using Our Application, accessing any material or information, using any Service or Product, provided, You agree to the following:<\/span><\/p><ol><li><b> Contacts<\/b><\/li><\/ol><p><span style=\"font-weight: 400;\">How to Contact us<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Email us at contact@askpinkypromise.com<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Call us or Message us on WhatsApp on +91 – 7070004653<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Or write to Us at: 29A, Laxmi Estate, Verma Nagar, Andheri (East), Mumbai-400 069, Maharashtra, India.<\/span><\/li><\/ul><p> <\/p><p><span style=\"font-weight: 400;\">How we Contact you<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We will contact You in any language of our choosing such as Hindi, English, Tamil, Marathi, or any other language which we may use in the future; through in-app notifications, Android\/iOS notifications, email, phone call, SMS, etc.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We will regularly send You Android\/iOS notifications and in-app notifications when We want to inform or remind You of something.<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"2\"><li><b> What we mean by Our Services<\/b><\/li><\/ol><p><span style=\"font-weight: 400;\">Chatbot<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Chatbot (Hindi\/Hinglish, English, Marhati, Tamil, and other languages that may be introduced from time to time) runs on a logic tree containing information regarding women’s sexual and reproductive health, especially relating to questions about periods, pregnancy, STIs, contraception, PCOS and more.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You must treat the advice\/information received from Us in the same manner that You would treat information You read on various online websites and articles when You google search Your problems. That is, You must NOT use any of Our Chatbot Services in lieu of visiting an actual doctor\/healthcare professional. <\/span><\/li><\/ul><p> <\/p><p><span style=\"font-weight: 400;\">Chatrooms <\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our chatrooms can be used by all Our Users anonymously (anonymous to other Users – not to Us), to engage in conversations with various other women facing the same\/similar issues as You, for several purposes like but not limited to, exchanging help, extending support, giving suggestions, and discussing possible solutions, without the fear of being judged. That is, You must NOT use any of Our Chatroom Services in lieu of visiting an actual doctor\/healthcare professional. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">At present, men too are permitted to use Our Chatrooms, since We believe that men being a part of Our community will only enable them to, further understand and help the women in their lives, and to become better members of society themselves. However, if We find the need to exclude men from the Chatrooms in a manner that would not discriminate against the LGBTQIA+ community, We reserve the right to do so.<\/span><\/li><\/ul><p> <\/p><p><span style=\"font-weight: 400;\">Doctor Consultations<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Application provides all Our Users with the option to purchase professional consultations with qualified doctors, who shall exercise their own discretion and expertise, and consult upon the medical information provided to them through text and\/or audio and\/or video, as per what the doctor deems necessary and appropriate in each case. Furthermore, the Doctors may also prescribe suitable medication and\/or tests during the consultation. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The doctors affiliated with Our Application are independent consultants and we do not endorse any of the said doctors or their advise. You are required to treat all medical consultations and diagnoses with the same discretion that you would, any consultation with an independent medical professional.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The doctors affiliated with Our Application are licensed to practice in India. If You choose to book a consultation with a doctor through Our Application while You are residing outside of the nation of India, it is Your sole prerogative and responsibility to check the laws, rules, and regulations, of the jurisdiction applicable to you, with re. to the use of consulting a doctor in India. Pinky Promise makes no representation or suggestion whatsoever that the doctors who can be consulted through the Application have any right, license, or authority, to practice medicine anywhere other than in India<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">Period Tracking <\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The Application requires you to provide certain information such as the date of your last menstrual cycle, duration, etc., which allows Our Application to determine and guide You with tracking your periods\/menstrual cycles. That is, You must NEVER use any of Our Period Tracking Services in lieu of visiting an actual doctor\/healthcare professional. These Services are general in nature and have been developed using generalised data, and the data so provided may vary in certain specific situations. Therefore, if you choose to follow any such general recommendations, do so at your own risk. Our Application does not give any guarantees that any of our services can be used to achieve specific aims, such as but not limited to menstrual cycle tracking, ovulation tracking, etc. or any other purposes, since Our Services rely on calculations based upon statistics and publicly available data, the models will fit most individuals most of the time, but will never fit every individual every time. <\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">Pathology<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">With the help of Our Application, You can book pathology tests which You may want to undertake, with Metropolis Healthcare Ltd. (Registration No.-<\/span><span style=\"font-weight: 400;\">192798, RoC-Mumbai). Our Application merely acts as a Facilitator for booking an appointment with Metropolis Healthcare Ltd. for Our Users<\/span><span style=\"font-weight: 400;\">. With the help of Our App, You can conveniently input the required information, and book pathology tests which You wish to take. The collecting of sample, analysis\/conducting of tests, and the communication of results, will be handled and undertaken by Metropolis Healthcare Ltd.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Any grievance or dispute arising out of the collection of samples, accuracy of tests, delivery of reports\/results, will be exclusively between You and Metropolis Healthcare Ltd. only. It is made clear that Pinky Promise will not be liable or responsible for any issues and disputes arising out of the collection of samples, accuracy of tests, or delivery of reports\/results. Pinky Promise does not have any control over the functioning of Metropolis Healthcare Ltd. And You understand that You are exercising your own discretion and judgement while selecting Metropolis Healthcare Ltd. as the Pathology Lab for the tests required by You. You understand that You are free to get tests from any Pathology Lab of your choosing, even when tests are prescribed by doctors through the Pinky Promise Application Platform. <\/span><\/li><\/ul><p> <\/p><p><span style=\"font-weight: 400;\">Our Products<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">‘Berry Magical’ Post-Pad Relief Cream and Body Lotion.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">‘Tranquil’ Night Face Serum for mid-cycle and PCOS related acne.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">‘Intimate Wash’ which is curated for maintaining intimate hygiene (external use only)<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">All of the above-mentioned Products are currently available on Our Application for purchase. ‘Berry Magical’ and ‘Tranquil’ are manufactured by Elegant Global Cosmetics, having address at – Shri Arihant Complex, Gala No. 10 and 11, Building No. C-14, Kalher, Bhiwandi, 428 302; and marketed by Us. ‘Intimate Wash’ is manufactured <\/span><span style=\"font-weight: 400;\">by Conor Cosmo India Pvt Ltd. Ambala Chandigarh Highway, Baldev Nagar, Ambala City &#8211; 134 007 Under the guidance of Thricegrow Healthcare.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We will be introducing more women’s wellness Products, including nutraceuticals.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You agree and understand that We only market the Products that are available for purchase. You understand that Elegant Global Cosmetics, <\/span><span style=\"font-weight: 400;\">Conor Cosmo India Pvt Ltd and other third-parties,<\/span><span style=\"font-weight: 400;\"> are the manufacturers of the Products, and hence, any liability accrued, whether or not indemnified, concerning or arising out of the use of the Products available for purchase on Our App, will accrue and lie only upon Elegant Global Cosmetics, <\/span><span style=\"font-weight: 400;\">Conor Cosmo India Pvt Ltd, and the respective third-party manufacturers<\/span><span style=\"font-weight: 400;\">, not on Us.<\/span><span style=\"font-weight: 400;\"><br \/><br \/><\/span><\/li><\/ul><ol start=\"3\"><li><b>Payments<\/b><\/li><\/ol><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Payments shall be made via a third-party provider – Razorpay. While we trust Razorpay, and they provide services to several leading E-commerce platforms, by agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, for any issues, problems, or losses, if any, caused to You by Razorpay\/due to using Razorpay’s services. For any queries, complaints or issues, You must contact Razorpay directly at – <\/span><\/li><\/ul><ol><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Phone No.: 080-46669555<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Email:  grievances@razorpay.com<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Address: Razorpay Software Private Limited, 1st Floor, SJR Cyber, 22, Laskar Hosur Road, Adugodi, Bangalore, Karnataka – 560 030. <\/span><\/li><\/ol><p><span style=\"font-weight: 400;\">You must read the latest updated Terms and Conditions of Razorpay everytime before You make a payment on Our App, the same can be found at https:\/\/razorpay.com\/terms\/. Furthermore, You are requested to check the latest updated contact details for Razorpay at www.razorpay.com. <\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Payments can be made via Net Banking, Debit Card, Credit Card, E-Wallets, Mobile Banking (GPay\/PayTM, etc.), etc. We are in the process of introducing Cash on Delivery as well.<\/span><\/li><\/ul><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You agree and understand that Razorpay handles and is responsible for all transactions, and hence, any liability accrued, whether or not indemnified, concerning or arising out of any financial transaction on Our App, will accrue and lie only upon Razorpay, and not on Us.<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"4\"><li><b>What Our Services Can and Can’t Do<\/b><\/li><\/ol><p><span style=\"font-weight: 400;\">Can Do<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We provide scientifically accurate, verified and personalized answers instantly to a large variety of reproductive health questions. Additionally, we provide scientifically accurate information pertaining to contraceptive choices, fertility, and conception.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Application enables you to use our Chatbot services, which provides you with the ability to quickly research queries concerning a woman’s reproductive system and sexual health.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Application enables you to use our Chatroom services, which is essentially an anonymous forum to connect with other women who have faced similar issues, and a platform to engage in an open conversation with each other. Issue specific Chatrooms allow You to ask follow-up questions, find answers to Your chronic-care conditions, and be supported by other women on Our Application in an anonymous (anonymous to other Users – not to Us) manner.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The Chatrooms are created by Us, but the information and messages You receive in the Chatrooms are from other Users like You, and unverified by Us. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We provide a non-judgmental, open space for You to address Your sexual and reproductive health, menstrual and sexual hygiene, related questions.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Application enables you to use our Doctor Consultation Services, which allows you to book and consult a professional Doctor.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Application enables you to use our Period Tracking services, which allows one to track their menstrual flow and cycles.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Application enables you to purchase from a variety of our products which are curated to specifically suit and cater to women’s sexual health and hygiene needs.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You can purchase Products including, but not limited to, cosmetic and nutraceutical preparations, that are marketed by us, as well as those of other brands, which cater to Your preventative and on-going health needs. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Application enables you to book Pathology Tests with Metropolis Healthcare Pvt. Ltd.<\/span><\/li><\/ul><p> <\/p><p><span style=\"font-weight: 400;\">Can’t Do<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Do not consider any of Our Services (that is not a Medical Doctor’s Consultation), as a replacement for a doctor\/qualified healthcare professional.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">In cases of emergencies, do not rely on our Chatbot, Products, Chatrooms, or even the Doctors’ Consultation through Our App. Instead, seek professional help. <\/span><span style=\"font-weight: 400;\">Use your own discretion to ensure you are able to seek emergency medical care from a nearby hospital\/clinic\/doctor versus relying on our platform. Our platform is not intended to replace or cannot serve as a source of emergency medical care.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We are here to give You information relating to Your health and to let You know about general causes, risks and possible next steps. Our ChatRoom Service is NOT designed to be used as a replacement for a doctor\/qualified healthcare professional.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You should always talk to a doctor\/qualified healthcare professional before making any decisions about Your health.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You are not permitted to use any of Our Products or Services or any other Intellectual Property, for any commercial use whatsoever. Commercial Use\/Intellectual Property Infringement of any of Our Services, Products, Design, Information, Written Content, any other Content, or Code, will force us to institute proceedings under civil and\/or criminal law against You and Your representatives, at Your cost. You agree that if this clause\/sub-clause is violated by You, by any person acting for You, by any person acting through You, by any of Your affiliates, by any person or entity connected to You in any way, the violation of this clause\/sub-clause will make You personally liable to pay Rs. 20,00,00,000\/- (Twenty Crore Rupees) in Damages to Us or any other amount in Damages calculated by Us, whichever is higher. You agree to pay the said Damages within two weeks of the claim\/demand being raised on You for the same or else pay 25% annual compound interest on the same, compounded monthly, until such amount as claimed\/demanded from You is paid to Us. Anything stated in this clause\/sub-clause is without prejudice to Our rights to additionally claim compensation and costs; and without prejudice to Our rights to separately, additionally file FIRs\/NCRs\/Police Complaints\/Private Complaints\/initiate any proceedings under Criminal law, against You or any other person whomsoever.   <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You may contact Us\/apply to Us for permission, if You desire to Use any of Our Products or Services or any other Intellectual Property, for any Non-Commercial Use such as for use by, NGOs, Charities, Non-Profit Companies, Schools, Colleges, Universities, Educational Institutions, any other Non-Profit Institution, etc. We will – completely at Our discretion, with or without providing any explanation to You – decide whether or not to grant any such permission applied for by You. You are not permitted to use any of Our Products, Services, any other Intellectual Property, Design, Information, Written Content, any other Content, Code, etc. without explicit written permission\/consent from Us, doing so without explicit written permission\/consent will force us to institute proceedings under civil and\/or criminal law against You and Your representatives, at Your cost. You agree that if this clause\/sub-clause is violated by You, by any person acting for You, by any person acting through You, by any of Your affiliates, by any person or entity connected to You in any way, the violation of this clause\/sub-clause will make You personally liable to pay Rs. 20,00,00,000\/- (Twenty Crore Rupees) in Damages to Us or any other amount in Damages calculated by Us, whichever is higher. You agree to pay the said Damages within two weeks of the claim\/demand being raised on You for the same or else pay 25% annual compound interest on the same, compounded monthly, until such amount as claimed\/demanded from You is paid to Us. Anything stated in this clause\/sub-clause is without prejudice to Our rights to additionally claim compensation and costs; and without prejudice to Our rights to separately additionally file FIRs\/NCRs\/Police Complaints\/Private Complaints\/initiate any proceedings under Criminal law, against You or any other person whomsoever.   <\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"5\"><li><b>Storage of Information<\/b><\/li><\/ol><p><span style=\"font-weight: 400;\">Why<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to the storage of, Your Chatbot use, Chatroom messages, purchase history, history of consultations, period tracking information, history of tests booked and various other data such as – Your personal details, location data, etc. For the purposes of training Our AI bot, further improving Our Products and Services, understanding market trends and needs, improving Our Code\/Software, improving Our UI\/UX, and for any third-party use.<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">Where<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your information\/data is currently stored and protected in MongoDB databases, MySQL databases and Amazon Web Services servers. However, We reserve the right to switch databases and\/or server providers at any time, or host the same in-house.  <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your information\/data may also be stored and\/or accessed on the devices of Our employees, third-party contractors\/freelancers, interns, and third-parties, for any reason whatsoever. <\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">By whom<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Your information\/data could be accessed by, persons of any age and gender, and third-party legal entities and individuals. Thus, by consenting\/accepting\/agreeing to these Terms of Service, You consent to the same.<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"6\"><li><b>Who can Access our Services<\/b><\/li><\/ol><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Currently, Our Application is only accessible to people aged 18 years and older.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Thus, if You agree\/consent\/accept these Terms of Service, but are infact a minor (under the age of 18), You could be prosecuted for the same.<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"7\"><li><b>Changes to these Terms<\/b><\/li><\/ol><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Ordinarily, no notification will be sent to You in case of any change to these Terms of Service, and your continued use of, Our Products, Services, and Application, shall signify Your acceptance of changes to the Terms of Service and Your agreement to be legally bound by the same. You are therefore requested and advised to read these Terms of Service every time before using any of Our Products and\/or Services.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We may however, at our discretion, choose to intimate you via Android\/iOS notifications and\/or in-app notifications and\/or email, about any changes to these Terms of Service.<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"8\"><li><b>Indemnities and Liabilities<\/b><\/li><\/ol><p><span style=\"font-weight: 400;\">8.1. Indemnities<\/span><\/p><p><span style=\"font-weight: 400;\">You hereby agree to indemnify, defend, and hold harmless Pinky Promise Pvt. ltd. and its Associates and their respective directors, officers, representatives, employees and agents from and against any and all losses, suffered or sustained by You or any other person, as a result of, arising from, or in connection with or relating to:<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Pathology Tests<\/span><span style=\"font-weight: 400;\"><br \/><\/span><span style=\"font-weight: 400;\">Any liability, or claim, that You may otherwise have been entitled to, for any issues or problems arising out of the collection of samples, accuracy of tests, delivery of reports\/results, delay in providing the report or incorrect report with regard to tests booked with Metropolis Healthcare Ltd. through Our App.<\/span><\/li><\/ul><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Doctor Consultations<\/span><span style=\"font-weight: 400;\"><br \/><\/span><span style=\"font-weight: 400;\">Any liability, or claim, that You may otherwise have been entitled to, for any deficiency in service or improper\/wrong diagnosis or prescription or advice, during, from, or arising out of a Doctor’s Consultation.<\/span><\/li><\/ul><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">HPV vaccination <\/span><span style=\"font-weight: 400;\"><br \/><\/span><span style=\"font-weight: 400;\">Any claim whatsoever, for any fault of KRM Healthcare or the Agents of KRM Healthcare, the provider of Gardasil Quadrivalent HPV Vaccine. Such as, but not limited to, any adverse reactions suffered by You due to the administration of the vaccine. <\/span><\/li><\/ul><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Chatbot<\/span><span style=\"font-weight: 400;\"><br \/><\/span><span style=\"font-weight: 400;\">Any liability, or claim, that You may otherwise have been entitled to, for any decision made\/action taken based on the information learnt by You through Our Chatbot.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Chatroom<\/span><span style=\"font-weight: 400;\"><br \/><\/span><span style=\"font-weight: 400;\">Any liability, or claim, that You may otherwise have been entitled to, for any decision made\/action taken based on the information learnt by You through and from other users on Our Chatrooms.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Our Products<\/span><span style=\"font-weight: 400;\"><br \/><\/span><span style=\"font-weight: 400;\">Any liability, or claim, that You may otherwise have been entitled to, for any adverse reactions or side effects caused by the use of any Product sold on Our Application or otherwise.<\/span><span style=\"font-weight: 400;\"><br \/><br \/><\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">8.2. Liabilities<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, for any adverse reactions or side effects caused by the use of any Product sold on Our Application or otherwise.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, for any decision made\/action taken based on the information learnt by You through Our Chatbot. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, for any decision made\/action taken based on the information learnt by You through Our Chatrooms. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, for any deficiency in service or improper\/wrong diagnosis or prescription or advice, during, from, or arising out of a Doctor’s Consultation. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us from any liability, or claim, that You may otherwise have been entitled to, for any issues or problems arising out of the collection of samples, accuracy of tests, delivery of reports\/results, with regard to tests booked with Metropolis Healthcare Ltd. through Our App.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, for any decision made\/action taken based on the Period Tracking Services.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us from any liability, or claim, that You may otherwise have been entitled to, for any issues or problems arising out of the administration of the HPV Vaccine, booked with KRM Healthcare through Our App.<\/span><span style=\"font-weight: 400;\"><br \/><br \/><\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">8.3. Content<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">While We shall try our best to prevent obscene (as defined in the latest edition of Black’s Law Dictionary) or abusive (as defined in the latest edition of Black’s Law Dictionary) behaviour on Our Chatrooms, We cannot guarantee the same. By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, for any obscene or abusive behaviour, or explicit content put forth by any User, that You might come across while Using Our Application or Our other Services.<\/span><span style=\"font-weight: 400;\"><br \/><br \/><\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">8.4. Technical<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, as a result of any technical glitches, virus attacks, identity theft, frontend issues, backend issues, server crashes, data breaches, malware, mobile phone problems, etc. regardless of the fault for the same lying with Us or with any of Our affiliates.<\/span><span style=\"font-weight: 400;\"><br \/><br \/><\/span><\/li><\/ul><p><span style=\"font-weight: 400;\">8.5. Financial<\/span><\/p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">By agreeing to these Terms of Service, You agree to discharge Us and any of Our affiliates, from any liability, or claim, that You may otherwise have been entitled to, as a result of any financial loss caused to You or any other person acting through\/for You, regardless of the fault for the same lying with Us or any of Our affiliates.<\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"9\"><li><b>Refund Policy<\/b><\/li><\/ol><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">We follow a No Refund Policy unless special circumstances exist, such as –<\/span><\/li><\/ul><ol><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Non-Delivery for a period of over 3 months after You have made the payment.<\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Damaged Products – We will, at Our discretion, call upon You to produce evidence in the manner, style, and format, that We deem appropriate to prove the authenticity of Your claim. We reserve the right to refuse any refund if the evidence as called for is not provided by You, or if We choose not to grant You a refund after examining the evidence provided by You. Any refund for Damaged Products will only be processed after the Products have been returned by You at Your cost (cost of return courier\/logistics paid by You – courier\/logistics company selected by Us).<\/span><\/li><\/ol><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"10\"><li><b>Free and Discounted Products and Services <\/b><\/li><\/ol><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You agree that any offer or even promise, to provide You with Products or Services at a discount or for free, may be withdrawn by Us at any point of time for any reason whatsoever. Additionally, You agree that if You have received any Product(s) or Service(s) for free or at a discount, You will return the Product(s) or pay the whole\/discount value for the Product(s) or Service(s) received by You, within one week of being called upon to do so by Us. You agree that We do not need to provide You with any reason whatsoever for withdrawing any offer or promise, at any point of time, including after You have already received the free\/discounted Products or Services. If any free\/discounted Products are withdrawn by Us after they have been received by You, You agree that the courier\/logistics costs to return the Products withdrawn by Us, will be paid by You. You agree to only use the courier\/logistics company that will be selected by Us. <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You agree never to use any ‘unfair means’ to try to gain any free\/discounted Products or Services. ‘Unfair means’ will include but will not be limited to the making of multiple ids, using multiple devices, coordinating with other persons in order to execute any strategy, exploit any bug or loophole in the software or in the offer, etc. to gain any points\/tokens\/coins, or to receive any free\/discounted Products or Services. You understand that any offer\/promise to provide You with any points\/tokens\/coins or any free\/discounted Products or Services is only meant to be gained\/availed of through regular and normal individual use of the Application and Website. You agree that if you make any attempt (whether or not successful) to use any ‘unfair means’ to try to gain any free\/discounted Products or Services, you will pay Pinky Promise, Damages as calculated solely by Pinky Promise, along with Compensation and Costs of any amount claimed by Pinky Promise, along with 18% compound interest compounded monthly.    <\/span><\/li><\/ul><p> <\/p><ol start=\"11\"><li><b>Non-Tolerance towards Obscene or Abusive behaviour<\/b><\/li><\/ol><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You will not say or do or attempt to do any action deemed to be obscene (as defined in the latest edition of Black’s Law Dictionary) or abusive (as defined in the latest edition of Black’s Law Dictionary) in nature. We reserve the Right to Ban you from Our Application and from accessing any of Our Services and Products, for any reason whatsoever, or if any of Your actions are found to be obscene (as defined in the latest edition of Black’s Law Dictionary) or abusive (as defined in the latest edition of Black’s Law Dictionary) in nature, at Our sole discretion. Similarly, any obscene or abusive behaviour towards any of the doctors, agents and employees of Metropolis Healthcare Ltd., agents and employees of KRM Healthcare, or any other third-party service provider, will not be tolerated, and You agree never to behave in an obscene or abusive manner towards the said persons. Further, You agree to not behave in any manner which shall constitute Bullying, Harassment or Cyber-Bullying, as per the general understanding of the meaning of the said terms. You agree that if this clause\/sub-clause is violated by You, by any person acting for You, by any person acting through You, by any of Your affiliates, by any person or entity connected to You in any way, the violation of this clause\/sub-clause will make You personally liable to pay Rs. 20,00,00,000\/- (Twenty Crore Rupees) in Damages to Us or any other amount in Damages calculated by Us, whichever is higher. You agree to pay the said Damages within two weeks of the claim\/demand being raised on You for the same or else pay 25% annual compound interest on the same, compounded monthly, until such amount as claimed\/demanded from You is paid to Us. Anything stated in this clause\/sub-clause is in addition to and without prejudice to, Our rights to additionally claim compensation and costs; and without prejudice to Our rights to separately additionally file FIRs\/NCRs\/Police Complaints\/Private Complaints\/initiate any proceedings under Criminal law, against You or any other person whomsoever.   <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You will not say or do or attempt to do any action deemed to be (by Us) a misuse of Our Chatrooms, or invasion of another User’s private space. If You try to misuse or misuse the Chatroom, try to invade or invade another User’s private space, You will not be allowed to access our Application, or any of Our Products or Services. You agree that if this clause\/sub-clause is violated by You, by any person acting for You, by any person acting through You, by any of Your affiliates, by any person or entity connected to You in any way, the violation of this clause\/sub-clause will make You personally liable to pay Rs. 20,00,00,000\/- (Twenty Crore Rupees) in Damages to Us or any other amount in Damages calculated by Us, whichever is higher. You agree to pay the said Damages within two weeks of the claim\/demand being raised on You for the same or else pay 25% annual compound interest on the same, compounded monthly, until such amount as claimed\/demanded from You is paid to Us. Anything stated in this clause\/sub-clause is without prejudice to Our rights to additionally claim compensation and costs; and without prejudice to Our rights to separately additionally file FIRs\/NCRs\/Police Complaints\/Private Complaints\/initiate any proceedings under Criminal law, against You or any other person whomsoever.   <\/span><\/li><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">You explicitly agree that any attempt, whether successful or not, to do any of the following acts, or to hack into\/unauthorizedly access – Our Code, Our Data, Our Servers, Our APK, Our devices, Our accounts with third-parties, Our IDs with third-parties, any of Our Users’ information, Your own information, Our Code, any of Our affiliates’ Code, Our Codebases, any of Our affiliates’ Codebases, any of Our Users’ devices, any of Our team members’ devices, any of Our affiliates’ devices, any of Our team members’ information, any of Our affiliates’ information, any of Our team members’ accounts with third-parties, any of Our affiliates’ accounts with third-parties, any of Our team members’ IDs with third-parties, any of Our affiliates’ IDs with third-parties, stealing any of Our Users’ identity, stealing any of team members’ identity, stealing any of Our affiliates’ identity, impersonating any of Our Users, impersonating any of Our team members, impersonating any of Our affiliates, reverse engineer any aspect of Our Application or Code, reverse engineer any aspect of Our Products or Services – by You, by any person acting for You, by any person acting through You, by any of Your affiliates, by any person or entity connected to You in any way, will make You personally liable to pay Rs. 20,00,00,000\/- (Twenty Crore Rupees) in Damages to Us or any other amount in Damages calculated by Us, whichever is higher. You agree to pay the said Damages within two weeks of the claim\/demand being raised on You for the same or else pay 25% annual compound interest on the same, compounded monthly, until such amount as claimed\/demanded from You is paid to Us. Anything stated in this clause\/sub-clause is without prejudice to Our rights to additionally claim compensation and costs; and without prejudice to Our rights to separately additionally file FIRs\/NCRs\/Police Complaints\/Private Complaints\/initiate any proceedings under Criminal law, against You or any other person whomsoever.  <\/span><\/li><\/ul><p><span style=\"font-weight: 400;\"> <\/span><\/p><ol start=\"11\"><li><b>Disputes and Arbitration<\/b><\/li><\/ol><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">In case of a dispute on any grounds whatsoever, You agree that the dispute will be settled through arbitration by a sole arbitrator. The Arbitrator shall be selected by Us and the Seat of Arbitration will be Mumbai, subject to the laws and jurisdiction of the city of Mumbai, Maharashtra, India. The Cost of Arbitration shall be borne entirely by You. The “Cost” shall include the fees of the Arbitrator, cost of Arbitration Premises and any other Ancillary costs related to the Arbitration. The Arbitration shall take place at a venue selected by Us, at the Seat of Arbitration, Mumbai.<\/span><\/li><\/ul>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Hello, Welcome to Pinky Promise Pvt. Ltd. Terms and Conditions. These terms of use (“Terms of Service”) govern the terms on which you (hereinafter referred to as “You” or “Your” or “User” or “Customer”) access, register on and use the ‘Pinky Promise’ Application, Services, or Products, operated by Pinky Promise Pvt. Ltd. (hereinafter referred to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/pages\/1712"}],"collection":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/comments?post=1712"}],"version-history":[{"count":5,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/pages\/1712\/revisions"}],"predecessor-version":[{"id":3531,"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/pages\/1712\/revisions\/3531"}],"wp:attachment":[{"href":"https:\/\/askpinkypromise.com\/wp-json\/wp\/v2\/media?parent=1712"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}